[{"key":"01021","_canTrack":"1","_country":"0102","_url":"http://afghanpost.gov.af/","_detail":"Afghan Post (AP) provides universal postal services with over one century history throughout the country. AP is a member of Universal Postal Union and EMS cooperative as well. It provides postal collection and delivery services both domestic and international via 463 post offices safe, secure & expedite.We keep your trust as continuous with best quality of services and affordable prices. We always think about our customers' satisfaction as well as their needs & demands with parallel to new global technological developments. For your assurance, all the projects for establishing of modern services and expansion of the traditional postal services are quickly progressing and Afghan Post will play the role of the best service provider within national Postal market with diversity of services soon.","_name":"Afghan Post"},{"key":"01031","_canTrack":"1","_country":"0103","_url":"http://www.postashqiptare.al/","_detail":"Albanian Post is a public company client oriented services to its network spread across the entire territory of the country to the most remote rural areas, offers wide range of postal and financial services with quality at competitive prices for individuals, businesses, institutions, and for all those who do not have access to banking. The activity of all postal services provided by the legislation in force for posts in the territory of Albania. Activity financial and banking services in accordance with banking legislation and license issued by the Bank of Albania. The company provides delivery of postal and financial services throughout the territory of the Republic of Albania. Postal services include: correspondence, letters, manuscripts, typescripts, small packages, kolipostën, telefax, telegrams sms.","_name":"Albanian Post"},{"key":"01041","_canTrack":"0","_country":"0104","_url":"http://www.poste.dz/","_detail":"Algeria hosted the post 04 and August 5, 2014, two days of training in the IFS (International Financial System) application, an application that automates the processing and management of international assignments, which involves the electronic exchange of Data on international express terms between sending and receiving countries. Currently the new version of the application developed by the Universal Postal Union (UPU), to which Algeria post migrated runs in a Web browser that is fast, efficient and secure tool allows the beneficiary to receive the mandate secret code transmitted by the sender with which he can collect his payment in the postal facility of choice across the country. This procedure will come into effect from September, it is for all postal facilities subsequently assembled to computer networks.","_name":"Algeria Post"},{"key":"01051","_canTrack":"0","_country":"0105","_url":"","_detail":"","_name":"Postal"},{"key":"01053","_canTrack":"0","_country":"0105","_url":"","_detail":"","_name":"Postal"},{"key":"01061","_canTrack":"0","_country":"0106","_url":"http://www.correiosdeangola.co.ao/","_detail":"The Post Office in Angola are a century-old institution in Angola, with a long history and strong presence among the population and institutions that have served. With the separation of the activities in the recent past the post and telecommunications, was created in 1980 the National Post and Telegraph Company of Angola, EP (Post of Angola), under the tutelage of the Ministry of Post and Telecommunications and the National Directorate of Posts.","_name":"Correios de Angola"},{"key":"01081","_canTrack":"0","_country":"0108","_url":"http://antarcticapost.tripod.com/","_detail":"Antarctica Post mail is posted at the the South Pole Station with stamps valid in all Antarctica and within the Antarctic Circle.","_name":"Antarctica Post"},{"key":"01101","_canTrack":"0","_country":"0110","_url":"","_detail":"","_name":"Postal"},{"key":"01121","_canTrack":"1","_country":"0112","_url":"http://www.correoargentino.com.ar/","_detail":"The Official Mail Argentina is the provider of the Postal, Telegraph and monetary public service, with national and international reach. Also part of the community mailing countries that comprise the Universal Postal Union (UPU). The UPU is composed of 192 members, and is designed to foster the development of universal postal services of quality, effective and accessible, to facilitate communication of all peoples of the world; promoting the adoption of operational, commercial, technological, regulatory standards and cooperation, guaranteeing the free circulation of postal items in an interconnected network.","_name":"Correo Argentina"},{"key":"01131","_canTrack":"1","_country":"0113","_url":"http://www.haypost.am/","_detail":"\"HayPost\" CJSC is the official national postal operator of the Republic of Armenia which provides postal, payment and retail services. HayPost currently operates through 900 of its postal offices across Armenia, from urban to the most remote rural regions. On November 30, 2006, the Dutch HayPost Trust Management B.V. was given the responsibility to operate HayPost. The purpose of the Trust Management is to make HayPost increasingly commercial, transparent, efficient and accountable for its customers in Armenia and abroad. Finally, the HayPost Trust Management will establish HayPost as a world class postal and financial services operator.","_name":"Haypost"},{"key":"01151","_canTrack":"1","_country":"0115","_url":"http://auspost.com.au/","_detail":"Australia Post has been keeping Australia connected for more than 200 years. We do this by delivering mail, helping businesses and consumers with parcels, and providing a national retail network that supports local communities and organisations. As the needs of the community have evolved, so have we, with a range of services spanning our stores, online and the Australia Post Digital MailBox. We complement our national logistics and retail network with convenient digital products to help make everyday life a bit simpler. Our enthusiastic and professional people are helping to build a modern Australia Post. They're dedicated to delivering products and services that Australians want, need and can afford, as well as ensuring that every experience with us is a positive one.","_name":"Australia Post"},{"key":"01161","_canTrack":"1","_country":"0116","_url":"http://www.post.at/","_detail":"Austrian Post is the leading logistics and postal services provider in Austria. Its main business activities include the transport and delivery of letters, direct mail items, print media and parcels. The branch network of Austrian Post ranks among the largest private customer networks in the country, offering high-quality postal, banking and telecommunications products and services to its customers throughout Austria. The company makes an important contribution to safeguarding the nation's communications and logistics infrastructure based on its nationwide and reliable supply of high quality postal services on behalf of the Austrian population and economy. Moreover, Austrian Post is also represented by subsidiaries in twelve European markets, particularly in the parcel and logistics segment as well as in unaddressed direct mail items.","_name":"Austrian Post"},{"key":"01171","_canTrack":"1","_country":"0117","_url":"http://www.azems.az/","_detail":"When Azerbaijan Democratic Republic declared its independence on May 28, 1918, in the structure of the government was established the Ministry of Post and Telegraph on October 06, 1918. On March 15, 1919 the interchange of postal items, money orders, valuable letters and parcels were organised between Azerbaijan and Georgia. Post-telegraph relations between Azerbaijan and Iran were originated on April 06, 1920. Since 20th years of previous century started dynamic development of post in Azerbaijan and figures were increased mainly compared to 1913. So if number of communication entities were 19 and received letters 3 million in 1913, these figures increased respectively 59 and 5 million.Azerexpresspost the founder of which \"Azerpost\" Production Association (at present \"Azerpost\" State Enterprise) was established by order No 108 dated July 14, 1997 of the Ministry of Communications of the Azerbaijan republic, passed through the state registration (identification cord No 3066394) at the Ministry of Justice of the Azerbaijan Republic on September 19, 1997 and started its functioning on January 9, 1998. At present it renders express mail services (EMS) under license No 001499 (registration No 056, September 3, 2004) of the Ministry of Communications and Information Technologies of the Azerbaijan Republic.","_name":"Azer Express Post"},{"key":"02011","_canTrack":"0","_country":"0201","_url":"http://www.bahamas.gov.bs/","_detail":"The Bahamas Postal Service established a savings bank in 1936 and later a postal money order service. Many family island communities had no other financial facilities available to them and some persons were unable to meet the requirements of the commercial banks. The postal service has grown and improved tremendously over the years. Today there are ten post offices strategically located throughout New Providence, with a total of 24,750 private mailboxes. Every island in The Bahamas is equipped with postal services.","_name":"Bahamas Post"},{"key":"02021","_canTrack":"1","_country":"0202","_url":"http://www.bahrain.bh/","_detail":"Bahrain Post provides full postal services such as local/international mail as well as additional services such as renewal of driving licenses, car registration, and vehicle insurance. Post offices are located in numerous locations in Bahrain and business hours vary depending on location.","_name":"Bahrain Post (Registered)"},{"key":"02022","_canTrack":"1","_country":"0202","_url":"http://www.bahrain.bh/","_detail":"Bahrain Post provides full postal services such as local/international mail as well as additional services such as renewal of driving licenses, car registration, and vehicle insurance. Post offices are located in numerous locations in Bahrain and business hours vary depending on location.","_name":"Bahrain Post (Parcel)"},{"key":"02023","_canTrack":"1","_country":"0202","_url":"http://www.bahrain.bh/","_detail":"Bahrain Post provides full postal services such as local/international mail as well as additional services such as renewal of driving licenses, car registration, and vehicle insurance. Post offices are located in numerous locations in Bahrain and business hours vary depending on location.","_name":"Bahrain Post (EMS)"},{"key":"02031","_canTrack":"0","_country":"0203","_url":"http://www.bangladeshpost.gov.bd/","_detail":"Ministry of Posts and Tele communication is one of the important ministries of the Government of the People's Republic of Bangladesh.  Ministry of Posts and Tele communication is primarily responsible for providing postal and Tele communication service in the country. This ministry is concerned with policy making for its two attached department.Bangladesh Post Office is an attached department of this ministry, catering to the postal needs of the people of Bangladesh.","_name":"Bangladesh Post (Registered/Parcel)"},{"key":"02033","_canTrack":"1","_country":"0203","_url":"http://www.bangladeshpost.gov.bd/","_detail":"Ministry of Posts and Tele communication is one of the important ministries of the Government of the People's Republic of Bangladesh.  Ministry of Posts and Tele communication is primarily responsible for providing postal and Tele communication service in the country. This ministry is concerned with policy making for its two attached department.Bangladesh Post Office is an attached department of this ministry, catering to the postal needs of the people of Bangladesh.","_name":"Bangladesh Post (EMS)"},{"key":"02041","_canTrack":"1","_country":"0204","_url":"http://www.bps.gov.bb/","_detail":"Barbados has one of the world's oldest postal services. In 1663, during the reign of Charles II, England's Imperial Post Office established a Packet Agency on the island.Barbados is only the second island in the British West Indies to establish an Inland Post Service by an Act of Parliament. The local Legislature passed the Post Office Act in 1851.Unlike the other Caribbean islands, British stamps were never used for domestic postage in Barbados. The first issue of \"Barbados\" stamps was placed on sale on April 15th, 1852, when the local Post Office also commenced operations. It is this date on which the anniversary of the Inland Post is celebrated.An Act of Parliament in 1854, served to amalgamate the Imperial Packet Agency and the Inland Post Office. By 1858 the Packet Agency was abolished and all mail received became the responsibility of the Colonial Postmaster.","_name":"Barbados Post"},{"key":"02051","_canTrack":"1","_country":"0205","_url":"http://belpost.by/","_detail":"A new period in the history of Belarusian-mail, marked by the development and implementation of a number of new services and modern technologies, began in 1995. Republican Unitary Enterprise \"Belpochta\" fulfills its primary mission - to provide postal services to the public, government agencies, enterprises and organizations, guided by the motto \"Speed​​. Reliability. Availability. \"These three words - strict compliance with all standards for receiving, processing, transmission and delivery of all types of mail, trouble-free operation and transport equipment, the introduction and use of new technologies. And for this motto - daily hard work of all many thousands of businesses - postmen, operators, sorters, drivers, technicians, professionals and managers - all those for whom mail has become a part of life.","_name":"Belpost"},{"key":"02061","_canTrack":"1","_country":"0206","_url":"http://www.bpost.be/track/","_detail":"Bpost is a modern, efficient postal company with a network of 670 post offices and 670 post points that provides the universal service in Belgium, serving every letterbox five days per week and delivering around 10 million letters and 100,000 parcels on a daily basis.","_name":"Bpost"},{"key":"02063","_canTrack":"1","_country":"0206","_url":"http://www.bpost2.be/bpostinternational/track_trace/find.php","_detail":"Bpost International is ranked in the world's top 5 international postal services – with good reason. We draw on decades of experience to deliver a top quality service complemented by a constant drive for improvement. Our extensive global network ensures proximity to customers in over 200 countries worldwide, and our local knowledge means we can provide tailored regional solutions and a service that's that little bit different – and that much better.","_name":"Bpost International"},{"key":"02071","_canTrack":"1","_country":"0207","_url":"http://www.belizepostalservice.gov.bz/","_detail":"The Belize Postal Service welcomes all to their offices online. We hope you find this site very informative and useful. It is our mission to continue serving the Belizean people in the most professional and efficient manner.","_name":"Belize Post"},{"key":"02081","_canTrack":"1","_country":"0208","_url":"http://www.laposte.bj/","_detail":"Correos de Benin SA has specific roles to ensure the whole country: The collection, transport and delivery of correspondence and goods; Collection and transfer of funds; The development of savings bank money, and postal financial services. It also contributes to the mission of the state below: The land around the Postal network; The defense of the State and Public Safety, including the fight against cyber crime and the introduction of the national territory of explosive, radioactive or chemical or drugs through the postal network; The fight against poverty by enabling the most disadvantaged layers or living in the remotest benefit of postal and basic financial services areas; Reducing the digital divide by a population's access to new technologies of information and communication; The exercise of any activity of general interest entrusted by the state.","_name":"La Poste De Benin"},{"key":"02101","_canTrack":"1","_country":"0210","_url":"http://www.bhutanpost.com.bt/","_detail":"The Postal Service in Bhutan was first launched on 10th October 1962 with the opening of a post office in Phuentsholing. In the same year, post offices were also opened in Paro and Thimphu. It was called the Department  of Posts and Telegraphs and placed under the Ministry of Communications. This was the initial step taken by the Royal Government to provide a uniform means of communication throughout the country. The policy was initiated on eve of the 1st Five Year Plan, noting the importance of the existence of a uniform means of communication throughout the country to the achievement of a balanced socio-economic development. Initially the services offered were basic services such as letter mail, postcards and parcels. International mail was only exchanged with India. Mail exchange within Bhutan and with India was transported through a unique mode of transport system, a combination of porters, mules and motor. Notwithstanding the simplicity in its daily operation and the hardship posed by the rugged terrain and extreme climatic condition in winter, it was an efficient set up and contributed to the growth of the nation, especially enhancing development in rural areas.","_name":"Bhutan Post"},{"key":"02111","_canTrack":"1","_country":"0211","_url":"http://www.correosbolivia.com/","_detail":"We are the Post Company Bolivia and work to give them the best care in postal services, money orders, stamps and other nationally and internationally. As members of the large network of world postal administrations (UPU - Universal Postal Union) reaching more than 189 countries on five continents with a wide variety of services as postales.Creada Supreme Decree No. 22616 dated October 8, 1990, subsequently was elevated to the rank of Republic Act No. 1424 dated January 29, 1993. In our country thanks to the coverage provided in the entire national territory, communicate to the Bolivian providing quality service, from traditional correspondence such as letters, postcards, magazines, braille letters, small packages and parcels optionally include a wide range of services additional to the shipment of large quantities of correspondences for small, medium and large businesses. 's Financial activity we have the wire service to everyone Bolivians through low fees and speed of your transfers.","_name":"Correos Bolivia"},{"key":"02121","_canTrack":"1","_country":"0212","_url":"http://www.posta.ba/","_detail":"All our post offices are equipped with the state-of-the-art postal automation systems, solutions and equipment, and are linked into information system. Therefore, in addition to providing the wide range of postal and other services, our post offices can provide you with an integrated postal and banking service. In addition to the existing ones, we are continuously introducing new facilities and services. The rapid development of postal transport, new range of services and increasing demands of our clients require our continuous adjustment ad flexibility. In addition to intensive investment activities, we rely on our experts and staff, and continuously introduce the cutting-edge world technologies. Amongst others, our projects include: Hybrid Mail Service, Sorting Centre, etc.","_name":"JP BH Post"},{"key":"02131","_canTrack":"1","_country":"0213","_url":"http://www.botspost.co.bw/","_detail":"The Postal Services is probably one of the oldest public services in Botswana, having been established in 1875 by the London Missionary Society. In those days, pairs of \"runners\" carried mail between various points on a stretch from Bulawayo up to Mafikeng. Historical records indicate that these runners (men on foot) carried up to 15542 postal items of mail per annum. Subsequently, the post used the train and road transport contractors to deliver mail until the late 1990's when the Post acquired its own fleet of delivery vehicles and continued to expand the mail delivery network.","_name":"Botswana Post"},{"key":"02151","_canTrack":"1","_country":"0215","_url":"http://www.correios.com.br/","_detail":"The Brazilian Post has originated in Brazil on January 25, 1663 and, ever since, is being modernized, creating and making available quality services corresponding to clients' expectations. Impelled by technologic, economic and social changes, Correios has begun in 2011 a deep modernization process. With Law 12.490/11 sanction, the company has enlarged its acting field and was equipped with modern tools for corporate management in order to face competition with more agile and efficient services rendering to the whole society. With the new law, Correios can act in foreign countries and in electronic, financial and integrated logistics services mail segments; constitute subsidiaries, acquire share control or participation in established companies and contract commercial partnerships that add value to its brand and to its network.","_name":"Correios Brazil"},{"key":"02161","_canTrack":"1","_country":"0216","_url":"http://www.post.gov.bn/","_detail":"In 1895, the Borneo Company established the 1st Post office. In 1906 (Treaty of Friendship), The Government Post office was built by the British Resident. Since 1984, Postal Service Department is under the responsibility of the Ministry of Communications. Our vision and mission of Brunei Postal Service Department: \"To become a business service and information centre\" To provide high quality services, fast, reliable and secure. To provide an efficient multi purpose centre. To cope with global communications demands.","_name":"Brunei Post"},{"key":"02171","_canTrack":"1","_country":"0217","_url":"http://www.bgpost.bg/","_detail":"14 May 1979. After the Russian-Turkish War (1877-1879), the Temporary Russian Governance hands over to Bulgarian authorities all postal and telegraph offices with their equipment and facilities. 1 July 1979. Bulgaria becomes a member of the Universal Postal Union. The start of official international contacts of Bulgarian posts is on 9 October 1880. 31 March 1997. Bulgarian Posts Ltd. is transformed into a joint-stock company with a state-owned share in the capital over 50 percent. 2005. By an amendment of the Privatization and Postprivatization Control Act, Bulgarian Posts PLC is included in the list of companies with more than 50 percent state share in capital prohibited for privatization. In the recent years. Bulgarian Posts PLC is a promisingly developing profitable company and the principal postal operator on the Bulgarian market.","_name":"Bulgarian Post"},{"key":"02181","_canTrack":"1","_country":"0218","_url":"http://www.sonapost.bf/","_detail":"Burkina Faso's position in its current configuration is the result of a long process marked by many changes that have made her a successively stripping services of French posts, Senegalese and Ivorian posts, Burkina Faso, depending on the evolution the country itself. And independence, from 1919 to 1932, the postal, telephone and telegraph were operating authority under the responsibility of the farmer Lazare Pathin. Due to the postal monopoly, postal workers had the right to search cars, locomotives and ships, to detect violations of monopoly. Services voltaic stations then under Dakar. From 1932 to 1946 with the abolition of the Upper Volta and linkage to Mali, Niger and Côte d'Ivoire, the service will break up to be attached to his country. At the creation of the Lower Ivory Coast (now Cote d'Ivoire) and Upper Ivory Coast (now Burkina Faso), services stations Haute Côte d'Ivoire will be those of the Lower Shore d'Ivoire, which was home to the headquarters of the Branch. A section of staff were based in Bobo-Dioulasso.","_name":"Sonapost"},{"key":"02191","_canTrack":"1","_country":"0219","_url":"http://www.poste.bi/","_detail":"Burundi Postal Administration was created under the decree no. 100/021 of March 7th 1991 and is operating since January 1st 1992. Erected as a personalised administration and as a legal entity with autonomous management. Burundi Postal Administration is under the authority of the Minister of Transport, Posts and Telecommunications. A Board of Directors, appointed upon proposal of the Minister, established the policy of the Postal Administration and decides on any issue submitted by the Management.","_name":"Burundi Post"},{"key":"03011","_canTrack":"1","_country":"0301","_url":"http://intmail.183.com.cn/","_detail":"China Post Group is a large-scale enterprise established in line with the Law of the People's Republic of China on Industrial Enterprises Owned by the Whole People. The Group engages in postal business in accordance with laws, undertakes the obligations of providing universal postal service, offers special postal services as may be entrusted by the Chinese government and conducts commercial. The main business scope of the Group includes: domestic and international mail delivery services, circulation of news papers, journals and books, stamp issuing, production and sale of philatelic collections, postal remittance services, confidential correspondence communication, postal financial services, postal express delivery and logistics services, e-business, a variety of postal agency businesses and other businesses as allowed by the state.","_name":"China Post"},{"key":"03013","_canTrack":"1","_country":"0301","_url":"http://www.11183.com.cn/","_detail":"China Postal Express & Logistics is mainly engaged in domestic express, international express, contract logistics, and LTL. Domestic and international express provides premium, standard and economy shipping products in terms of delivery time, and also operates some value-added service such as COD. Contract logistics covers the overall process of supply chain, including warehousing, and transport. The company possesses world-acclaimed brand \"EMS\", and leading domestic logistics brand \"CNPL\".Adhering to the service philosophy of \"Treasure Every Moment, Serve with Heart at Every Step\", the company is dedicated to offering customers with convenient, fast, secure and reliable door-to-door express and logistics services, and becoming a domestically leading and globally competitive Express & Logistics company with the strongest integrated service capacity.","_name":"China EMS"},{"key":"03014","_canTrack":"1","_country":"0301","_url":"http://khcx.gdpost.com.cn/","_detail":"China Post Group is a large-scale enterprise established in line with the Law of the People's Republic of China on Industrial Enterprises Owned by the Whole People. The Group engages in postal business in accordance with laws, undertakes the obligations of providing universal postal service, offers special postal services as may be entrusted by the Chinese government and conducts commercial. The main business scope of the Group includes: domestic and international mail delivery services, circulation of news papers, journals and books, stamp issuing, production and sale of philatelic collections, postal remittance services, confidential correspondence communication, postal financial services, postal express delivery and logistics services, e-business, a variety of postal agency businesses and other businesses as allowed by the state.","_name":"GuangDong Post (Surface)"},{"key":"03021","_canTrack":"1","_country":"0302","_url":"http://www.cambodiapost.com.kh/","_detail":"EMS International Postal Service Express Mail Service offered by postal Caribbean Universal Postal Union of Universal Postal Union (UPU). Universal Postal Union (UPU), Universal Postal Union is a professional organization of Nations which comprises of postal services worldwide. EMS Today, the Ministry has taken seriously Service for Express Mail Service (EMS). EMS is a leading service currently covers Covering the entire territory, and parts of the world. Biggest advantage of Cause global structure allows clients to send mails to almost everywhere Worldwide. Equipped with modern technology and equipment, such as International Postal System (IPS) and the latest scanning Customers become more confident.","_name":"Cambodia Post"},{"key":"03031","_canTrack":"1","_country":"0303","_url":"http://www.campost.cm/","_detail":"CAMPOST is a publicly owned company enjoys financial autonomy and created by Decree No. 2004/95 of 23 April 2004 the President of the Republic. Our vision: Improving and adapting its products and services to continually meet the needs of its customers, the Cameroon Postal Services aims to become the benchmark for postal companies and financial postal services in Africa and establish itself as a leading provider of services in Cameroon and Africa. Our mission: CAMPOST mission is to effectively operate postal services and postal financial resources to give complete satisfaction to all of its national and international clients.","_name":"Campost"},{"key":"03041","_canTrack":"1","_country":"0304","_url":"http://www.canadapost.ca/","_detail":"Canada Post will be a world leader in providing innovative physical and electronic delivery solutions, creating value for our customers, employees and all Canadians. Building and maintaining trusted relationships with employees, customers, partners, suppliers and our shareholder is fundamental to our business, our reputation, and our success. Managing in an ethical way, guided by a sense of social responsibility is not just a matter of good business practice; it is the right thing to do. Like all large organizations, Canada Post is often faced with challenges that require difficult decisions. The Canada Post Code of Conduct explains the behaviour that is expected of employees at all levels of the company, and provides information on where to find additional help.","_name":"Canada Post"},{"key":"03061","_canTrack":"1","_country":"0306","_url":"http://www.correios.cv/","_detail":"Correios de Cabo Verde is the company responsible for postal service in Cape Verde.","_name":"Correios Cabo Verde"},{"key":"03081","_canTrack":"0","_country":"0308","_url":"","_detail":"","_name":"Postal"},{"key":"03101","_canTrack":"1","_country":"0310","_url":"http://www.correos.cl/","_detail":"Correos Chile is an autonomous state enterprise established by DFL No. 10, December 24, 1981 Today is the national market leader in the delivery of mail and packages. Handled annually handles more than 300 million cards and 4 million packages. CorreosChile country is a company that covers 100% of the national territory. The company has been incorporated successfully in the international arena, globalizing processes and quality standards, allowing ship all over the world safely and quickly. CorreosChile is a modern, efficient and professional service to all Chilean company.","_name":"Correos Chile"},{"key":"03121","_canTrack":"0","_country":"0312","_url":"http://www.laposte.ci/","_detail":"The postal service began in Côte d'Ivoire, July 29, 1843 at Assini where the first post office was opened on August 17th 1862 Those of Grand-Bassam and Adiaké open their doors nearly a century later, in 1945, followed by the installation of a true Post and telecommunications (APT) by the colonial power. The Post Office will not know any significant change until 1975 when the Office is born of Posts and Telecommunications. This will be split in 1984, giving birth to the National Post Office and the Office National des Telecommunications. The NPO will be transformed May 15, 1991 and became the Ivorian Company of Post and Savings, a private capital of 3 billion CFA francs, 98% owned by the state and 2% by the company staff. SIPE is dissolved and replaced June 30, 1998 by the current organization under the name of La Poste in Côte d'Ivoire.","_name":"La Poste De Côte d'Ivoire"},{"key":"03131","_canTrack":"1","_country":"0313","_url":"http://www.4-72.com.co/","_detail":"4-72 is a member of the largest distribution network physics: Universal Postal Union - UPU, agency specialist headquartered in Bern, Switzerland. a organization with 5 million employees operating in 193 countries, which constitutes the main forum cooperation between postal sector actors that keeps a truly universal network modern products and services. National Postal Services SA is the official postal operator Colombia and therefore are the only service providers Mail Domestic and International Money Orders. We are the company which has been assigned the responsibility to ensure a universal postal service quality, competitive and universal. We offer a broad portfolio of products and services and courier expressed by the greater network coverage nationwide.","_name":"4-72"},{"key":"03141","_canTrack":"0","_country":"0314","_url":"","_detail":"","_name":"Postal"},{"key":"03151","_canTrack":"0","_country":"0315","_url":"","_detail":"","_name":"Postal"},{"key":"03161","_canTrack":"0","_country":"0316","_url":"","_detail":"","_name":"Postal"},{"key":"03171","_canTrack":"0","_country":"0317","_url":"","_detail":"","_name":"Postal"},{"key":"03181","_canTrack":"1","_country":"0318","_url":"http://www.correos.go.cr/","_detail":"Mission and Vision Correos de Costa Rica SA: Correos de Costa Rica in modern and provide solutions in logistics, communication and related that generate added value and customer loyalty. Our vision : We will be leaders and innovators in the market for logistics services, and related communications, providing our clients with comprehensive solutions to their needs.","_name":"Correos Costa Rica"},{"key":"03191","_canTrack":"1","_country":"0319","_url":"http://www.posta.hr/","_detail":"Since the splitting of Croatian Post and Telecommunications into Croatian Post Inc and Croatian Telecommunications Inc on 01 January 1999, Croatian Post has been functioning as an independent company with share capital, continuing the tradition and continuity of postal activity in the territory of the Republic of Croatia. As economic activity post has always been different from all other kinds of productive activities since its final goal is of general interest. Thus, Croatian Post has until today, as a modern economic activity, preserved that basic characteristic of its purpose and its relation to users.  Exactly for this characteristics and its long and reach historic development Croatian Post succeeds today a remarkable business reputation and enjoys great thrust of users in its services.","_name":"Croatian Post"},{"key":"03201","_canTrack":"0","_country":"0320","_url":"","_detail":"","_name":"Postal"},{"key":"03211","_canTrack":"1","_country":"0321","_url":"http://www.mcw.gov.cy/","_detail":"Welcome to the upgraded website of the Cyprus Post. I aspire that through this you will have the opportunity to check out our main responsibilities and activities, as well as the services we provide to the public. Our vision is to make Cyprus Post a modern and flexible organization with administrative and financial autonomy to react quickly to changing market needs and respond effectively to competition at local and international level for the benefit of the citizens. Our goal and ambition is to harness the potential of information technologies and by means of the two-way communication through our website, to create the conditions to receive your suggestions and ideas to improve the quality of our products and to deliver new innovative services. All officers of Cyprus Post and myself are at your disposal in order to upgrade the quality of services we provide.","_name":"Cyprus Post"},{"key":"03221","_canTrack":"1","_country":"0322","_url":"http://www.ceskaposta.cz/","_detail":"Česká pošta, s. p. is an organisational unit of the ministry. The economic management of the Post, set up on 1 January 1925, followed similar rules to those applied to private businesses. The efforts to reform the postal service soon made the enterprise profitable, and the profitability era lasted until the global economic crisis. The final decision was made at the top government level: Czech Post became a state-owned enterprise as of 1 January 1993, together with the formation of an independent Czech Republic. This allowed the Post to further develop the tradition of the interwar state-owned enterprise Czechoslovak Post and to prove the viability and sense of its existence in the conditions of market economy.","_name":"Czech Post"},{"key":"03231","_canTrack":"0","_country":"0323","_url":"","_detail":"","_name":"Postal"},{"key":"04011","_canTrack":"1","_country":"0401","_url":"http://www.pakkeboksen.dk/","_detail":"Post Danmark provides basic postal services to all customers in Denmark – senders and recipients alike. Post Danmark's aim is to be the best postal service provider in Europe, measured in terms of service level, quality and price combined. In December 2010, the Danish Parliament passed a new Postal Services Act, which regulates the provision of postal services in Denmark while at the same time implementing the final part of deregulation of the Danish postal market with effect from 1 January 2011. The Postal Services Act allows for free competition and ensures that Post Danmark fulfils the role as provider of postal services falling within the scope of the universal service obligation. Post Danmark delivers mail to all households and businesses throughout the country six days a week. In addition, products subject to the universal service obligation still include addressed letters as well as daily, weekly and monthly papers up to 2 kilos and addressed parcels up to 20 kilos. Post Danmark can trace its history as far back as 1624 when King Christian IV signed a decree concerning the establishment of a network of postmen in Denmark. Ever since then, we have provided reliable, fast and accessible transport of mail in Denmark and abroad.","_name":"PostNord Danmark"},{"key":"04021","_canTrack":"0","_country":"0402","_url":"http://www.laposte.dj/","_detail":"","_name":"La Poste De Djibouti"},{"key":"04031","_canTrack":"0","_country":"0403","_url":"http://publicworks.gov.dm/","_detail":"The General Post Office caters to the mail process in Dominica. Situated on the Dame Eugenia Charles Boulevard, it is the central hub to mail in Dominica serving the entire island through several smaller post offices catering to the population's mail needs. Today, the Postal Service has extended its services through the length and breadth of the island with twenty three (23) Post Offices, twelve (12) Postal Agencies and nineteen (19) Village Councils. The General Post Office which is housed in the same building as the Training Centre was opened on August 9, 1993 by the Prime Minister Dame Eugenia Charles and The Right Hon The Baroness Chalker of Wallasey- Minister for Overseas Development.","_name":"Dominica Post"},{"key":"04041","_canTrack":"1","_country":"0404","_url":"http://www.inposdom.gob.do/","_detail":"About INPOSDOM, The 16 November 1963 by the Communications Act No. 40 Postcards, the Directorate General of Post was created as a unit of the Ministry of Public Works and Communications, regulate the operation of the postal service in the country. The General Post Office operated until November 15, 1985 was created by Act 307, the current Instituto Postal Dominicano, autonomous body, governed by a Board of Directors.  From the first constitutional government of Dr. Joaquín Balaguer, in 1966, when the modernization process of this vital public service began with an expansion that covers even the remotest villages of the country.  Also outside the country, has direct connections with all emails worldwide. Currently, the Dominican postal service annually mobilizes tens of thousands of letters, parcel post, couriers and also correlation genres, including cash transfers in major world currencies.  Consistent with the modernization of this public service, which is a testament to the construction of the Palace of the Dominican Postal Institute, plus several post offices built since 1993.","_name":"Inposdom"},{"key":"05011","_canTrack":"1","_country":"0501","_url":"http://www.correosdelecuador.gob.ec/","_detail":"Correos del Ecuador EP CDE, is a Public company postal and logistics services with technology and coverage nationally and internationally committed to quality, excellence and warmth requested by citizens and businesses in general without discrimination, contributing to the development of country. Our vision: 2017 To be the leader in the market for postal and logistics services as well as a reference for postal operators in the region, known for its coverage of national and international level, optimal response times, security and compliance commitments with our customers.","_name":"Correos Ecuador"},{"key":"05021","_canTrack":"1","_country":"0502","_url":"http://www.egyptpost.org/","_detail":"Egypt Post is one of the main pillars of the country, because it conveys country's decrees, facilitates duties of government, establishes relations between groups, individuals and connects them with the outer world. On the Arab and African levels, Egypt was among the leading Administrations involved in international postal movement, began in Europe late in 19th century and the beginning of the last century. Egypt is the only Arab and African country organized the Universal Postal Congress in its 10th session in 1943. The Ministerial decree No 70 of 1982 for Organization's personnel statute, (a special regulation), had been issued, ministerial decree No 55 of 1982 for the financial statute of the Organization (a special regulation), was issued too. Finally, in 1999, the Ministry of Communications and Information Technology had been established to assume the supervision of National Post Organization, Telecom Egypt, and National Telecommunications Institute.","_name":"Egypt Post"},{"key":"05031","_canTrack":"1","_country":"0503","_url":"http://www.epg.gov.ae/","_detail":"Emirates Post Group manages the long-term and medium-term planning of its postal operational division and subsidiaries, which consist of Wall Street Exchange Center and Electronic Documents Centre. The Emirates Post Group constantly seeks to provide postal services and solutions that match the latest trends in global postal services, with a focus on making post offices one-stop shops that offer multiple services through a network over 115 post offices, driven by the goal of constantly raising customer satisfaction and adhering to principles of corporate social responsibility. The Group offers quality services under postal and non-postal categories. In Postal services, it provides personalized mailing solutions, local and international Express Mail, domestic and international courier services, money transfer (Instant Cash service and UPU's International Financial System). In non-postal services, the Group offers vital community services in prtnership with government agencies and private sector companies. The prtfolio includes Government services, utility bill payment services, financial services, travel services. The Group also offers corporates a unique service of Marketing Solutions, which include advertising through Post and Promotional Stamps.","_name":"Emirates Post"},{"key":"05041","_canTrack":"1","_country":"0504","_url":"https://www.omniva.ee/","_detail":"The new international name of Eesti Post is Omniva. We are an international logistics company that transports goods and information. We create e-solutions that make it easier for companies to do their work. We are a partner for buyers and for sellers. We bring goods quickly to the shopper's home, a nearby post office or a parcel machine. Just the way it suits each individual. Our story starts officially on 13 November 1918 when the newly-emerged Estonian Republic took over the Tallinn post and telegraph office from the Germans and founded its own national postal service. The story has continued for 95 years and many exciting chapters have been written in it, and now, in 2014, we are starting a new chapter. The title of the chapter is Omniva. We are an international logistics company. Traditional postal services, where our story started, now make up only third of our business and for this reason the name Eesti Post has grown a little small for us now. This well-known and tradition-rich name will remain and you will see it whenever you enter a post office or meet our mail delivery staff in the streets, but you will know our international logistics company under a new name from now on.","_name":"Omniva"},{"key":"05044","_canTrack":"1","_country":"0504","_url":"http://worktrace.com/servlet/authentification.LoginServlet?user=ESTONIA&language=UK&WTact=public&WTCONTEXT=tandtCritImbed","_detail":"The new international name of Eesti Post is Omniva. We are an international logistics company that transports goods and information. We create e-solutions that make it easier for companies to do their work. We are a partner for buyers and for sellers. We bring goods quickly to the shopper's home, a nearby post office or a parcel machine. Just the way it suits each individual. Our story starts officially on 13 November 1918 when the newly-emerged Estonian Republic took over the Tallinn post and telegraph office from the Germans and founded its own national postal service. The story has continued for 95 years and many exciting chapters have been written in it, and now, in 2014, we are starting a new chapter. The title of the chapter is Omniva. We are an international logistics company. Traditional postal services, where our story started, now make up only third of our business and for this reason the name Eesti Post has grown a little small for us now. This well-known and tradition-rich name will remain and you will see it whenever you enter a post office or meet our mail delivery staff in the streets, but you will know our international logistics company under a new name from now on.","_name":"Omniva (WorkTrace)"},{"key":"05051","_canTrack":"1","_country":"0505","_url":"http://www.ethiopostal.com/","_detail":"Ethiopian Postal Service is the company responsible for postal service in Ethiopia. Prior to the admission of Ethiopia to the UPU in 1908, international mail from Ethiopia had to be additionally franked with stamps of UPU members. France operated post offices at Addis Ababa, Harar, and Dire Dawa, using stamps of Obock or the French Somali Coast, and mail is known with a triple franking of Ethiopia, British Somaliland (via the town of Zeila), and Aden.","_name":"Ethiopian Post"},{"key":"05061","_canTrack":"1","_country":"0506","_url":"http://www.eriposta.com/","_detail":"The Eritrean Postal Service (EPS) is the government organisation responsible for the postal service in Eritrea. Asmalash Gebreyesus is the current manager.[1] In 2009, the Eritrean Postal Service delivered 1.8 million letters. Eritrea Postal Service Strives to Provide More Efficient Services.","_name":"Eritrea Post"},{"key":"05071","_canTrack":"0","_country":"0507","_url":"","_detail":"","_name":"Postal"},{"key":"05081","_canTrack":"0","_country":"0508","_url":"","_detail":"","_name":"Postal"},{"key":"06031","_canTrack":"1","_country":"0603","_url":"http://www.postfiji.com.fj/","_detail":"Post Fiji's history lies in the first Postal Act passed by the Legislative Assembly of the Fiji Government in December 1871, which officially established the setting up of a Postal Department in Fiji, a General Post Office, Post Offices in other parts of Fiji and the appointment of a Chief Postmaster and other Postmasters who may be required to operate these Post Offices. The Cakobau Postal Act prepared and guided those who were to play a pioneering role in the operation and development of postal services in Fiji. Until 1989, Fiji's postal operations were a division of a government department called the Department of Posts and Telecommunications. Subsequently, the department became corporatised in 1990 and from this first year of corporatisation to 30 June 1996, Fiji Posts and Telecommunications was restructured three times. On 30 June 1996, the inevitable separation of Post and Telecommunications was formalized. Two new entities rose in its stead - Post Fiji Ltd and Telecom Fiji Ltd.","_name":"Fiji Post"},{"key":"06041","_canTrack":"1","_country":"0604","_url":"http://www.posti.fi/","_detail":"Itella is your first choice in postal, logistics and e-commerce services. We manage the flow of commerce and everyday life in 11 countries. Our net sales in 2013 amounted to EUR 1,977 million. We employ approximately 26,000 professionals. We deliver corporate services under the Itella brand, while the Posti brand is used for services targeted at consumers in Finland. Itella is owned by the state of Finland, providing us a credible background and long-term commitment to our strategy. Business customers account for approximately 96 per cent of the net sales. Our key customer industries include the media as well as the trade and services industries. As of January 1, 2015, Itella Corporation will change its company name to Posti Group Corporation. In future, Posti will serve both consumer and business customers under one service brand. The change will further improve customer experience and clarify the company's identity as a Finnish postal, logistics and eCommerce services. An Extraordinary General Meeting of Itella made the decision on changing the name of the group. As of January 1, 2015, the new name of Itella Corporation will be Posti Group Corporation.","_name":"Itella Posti"},{"key":"06051","_canTrack":"1","_country":"0605","_url":"http://www.laposte.fr/","_detail":"La Poste Group generates more than 17% of its turnover abroad thanks to the dynamism of the parcel business. Present in over 40 countries on 4 continents. It greatly expands its parcel business in countries in Europe and worldwide international mail business. Preferred partner for online retailers in France, the Group carries nearly 1 billion packages per year, a turnover of more than € 5 billion and 14.9% share of the European market. To develop this market, the Group relies on GeoPost and its subsidiaries, already No. 2 in Europe. The most important platforms are located in France, Germany, the Netherlands and Poland. In all, the network includes 800 GeoPost deposits, 60 hubs, 500 interconnected by daily international road links connecting 35 European countries. La Poste and Swiss Post Group have teamed up through a joint venture ASENDIA to bring their expertise and networks of cross-border mail in the United States, the United Kingdom, continental Europe, and Asia. Through the activity of international mail, the company operates on three continents with more than 25 sites in 15 countries.","_name":"La Poste"},{"key":"06052","_canTrack":"1","_country":"0605","_url":"http://www.colissimo.fr/","_detail":"","_name":"Colissimo"},{"key":"06053","_canTrack":"1","_country":"0605","_url":"http://www.chronopost.fr/","_detail":"Chronopost is one of the major players in the express delivery of parcels up to 30 kg to businesses and individuals around the world. GeoPost subsidiary, holding and Express Parcels of La Poste, Chronopost employs 3,500 employees and carried 102.2 million package in 2013 Chronopost in France is based on a network of 80 operational sites, including 6 hubs. Chronopost serves more than 230 countries in Europe and worldwide. Since 1 July 2012, Chronopost has embarked on a process of total carbon compensation by participating in the program Geopost ZERO TOTAL Group. Chronopost is the first express carrier to be completely CO2 neutral and without additional cost to the customer. Chronopost supports annual 2 million international packages. Chronopost integrates its services procedures express clearance thanks to its status as customs and AEO (Authorized Economic Operator). All packages Chronopost to transit through the international hub at Roissy, where 140 people take turns 7/7 24/24 to deal with his package. Dedicated customer and expertise in international service.","_name":"Chronopost"},{"key":"07011","_canTrack":"0","_country":"0701","_url":"","_detail":"","_name":"Postal"},{"key":"07021","_canTrack":"0","_country":"0702","_url":"http://www.gampost.gm/","_detail":"GAMPOST has a long, rich, and proud history, dating back almost 150 years to 1858 when the British introduced international postal services in The Gambia. Domestic mail services started in 1922, with the introduction of the \"Prince of Wales\", the traveling Post Office boat. The present Department of Posts was created in 1976, when the former Department of Posts and Telecommunications, which was responsible for both domestic postal and telecommunications services, was split into two separate departments. In 1984, the Government commissioned a study on the creation of an autonomous postal service. The outcome of the study showed that the time was not right for the postal service to change its status. An update of  the study was carried out in 2004 / 5 which showed the post could be a viable entity if the right structures are put in place. The recommendation was accepted by Government culminating in the passage of Gambia Postal Services Corporation (GAMPOST ) Act by the National Assembly in December 2005.","_name":"Gambia Post"},{"key":"07031","_canTrack":"1","_country":"0703","_url":"http://gpost.ge/","_detail":"Georgian Post is a member country of Universal Postal Union since 1993.  Membership of this union is very important for Georgia, because it gives a possibility to integrate postal network of the country into the network of the Universal Postal Union. Georgian Post has a long history. It is a well-known fact that from the ancient time transmission of information was provided by \"couriers\" and \"messengers\" in Georgia, which was mentioned in \"Kartlis Tskhovreba\" several times. At the end of 19th century, important representative of the Georgian Economy Mentality, Ioane Batonishvili wrote rules of reform of the State structure, thinking that the arrangement of the post office stations would be necessary for people and profitable for the Treasury. The postal connection network has developed and increased step by step and nowadays in the process of unexampled enlargement of exploitation of the means of electronic communication, Georgian Post founded in 1995, with the government share fraction is 100% and whose founder is \"Georgian Ministry of Communication and Post\", keeps its universal place, by providing the postal service on the whole territory of Georgia.","_name":"Georgian Post"},{"key":"07041","_canTrack":"1","_country":"0704","_url":"http://nolp.dhl.de/","_detail":"DHL Paket is the easy, affordable, fast and reliable shipping service to over 220 countries around the world. You can arrange delivery from your PC, use the network of over 2,650 Packstations and 1,000 Paketboxes, or call in to one of our 13,000 outlets or one of more than 10,000 Paketshops.","_name":"DHL Paket"},{"key":"07045","_canTrack":"1","_country":"0704","_url":"https://www.globalmail.dhl.com/web/portal-asia/traceit","_detail":"DHL eCommerce is redefining residential delivery for both your business and your customers, through innovative solutions supported by state-of-the-art operations systems. We provide a comprehensive suite of domestic and international services for the secure and reliable distribution of mail and parcels. Plus, we offer an expanding range of value-added services.","_name":"DHL GlobalMail"},{"key":"07046","_canTrack":"1","_country":"0704","_url":"https://www.gdsk.de/","_detail":"","_name":"GDSK"},{"key":"07047","_canTrack":"1","_country":"0704","_url":"http://webtrack.dhlglobalmail.com/","_detail":"DHL eCommerce is redefining residential delivery for both your business and your customers, through innovative solutions supported by state-of-the-art operations systems. We provide a comprehensive suite of domestic and international services for the secure and reliable distribution of mail and parcels. Plus, we offer an expanding range of value-added services.","_name":"DHL(US) eCommerce"},{"key":"07048","_canTrack":"1","_country":"0704","_url":"https://dhlecommerce.asia/Portal/Track","_detail":"DHL eCommerce is redefining residential delivery for both your business and your customers, through innovative solutions supported by state-of-the-art operations systems. We provide a comprehensive suite of domestic and international services for the secure and reliable distribution of mail and parcels. Plus, we offer an expanding range of value-added services.","_name":"DHL(ASIA) eCommerce"},{"key":"07051","_canTrack":"1","_country":"0705","_url":"http://www.ghanapost.com.gh/","_detail":"Ghana Post was incorporated by an Act of parliament, Act 505 in August 1995 thereby formally separating it from Ghana Telecom Company. By this Act of incorporation, the corporation was expected to operate on sound commercial lines, and to be self-supporting.In July 1999, Ghana Postal Services Corporation was converted to a limited liability company. The conversion therefore placed the company together with similar private enterprises in the same legal and regulatory operating environment. It therefore enabled the company to operate successfully in a competitive commercial environment and also widened the objects of the company as it existed under Act 505.Since Ghana Post is a story of outstanding success, it pays tribute to entrepreneurial drive and professional skills of our management and staff. Success has meant tremendous growth of the company itself. Within this past years, Ghana Post has quickly established itself at the forefront of the courier industry in the country.","_name":"Ghana Post"},{"key":"07071","_canTrack":"1","_country":"0707","_url":"http://www.elta.gr/","_detail":"Hellenic Post (ELTA) is a strong group of companies, providing Greek citizens with modern high quality postal services at affordable prices. It was founded in 1828, almost simultaneously with the foundation of the Greek State, through a presidential decree issued by Ioannis Kapodistrias.  Since 1996 it operates as a SA (\"ELTA SA\"). Hellenic Post is the leader of the Greek postal market and the universal service provider. According to the \"Postal Services, Electronic Communications and Other Provisions\" Law, Hellenic Post undertakes the obligation of providing universal services for a period of 15 years (until 31/12/2028).   This means that we offer high quality services at affordable prices to all citizens and businesses in all parts of Greece.  We deliver this universal service through the largest retail network in Greece with more than 1,500 access points. In Hellenic Post, we focus on satisfying our customer's needs: this means a focus on innovation, on using to the full the opportunities created by new cmputerised technologies, and on bringing forward new products and services to meet our customer's changing needs.  This has enabled us to build a very strong and long-lasting relationship of trust with customers.  Over recent years, we have met all the quality standards for the distribution of domestic and international lettermail required by the Greek Postal regulator (EETT) and by the International Post Corporation.","_name":"ELTA"},{"key":"07091","_canTrack":"0","_country":"0709","_url":"http://www.grenadapostal.com/","_detail":"The Postal Service came to Grenada during colonization by the British in the eighteenth century. Until January 23th, 1997 the Post Office served as a department within the Ministry of Communications and Works. The Grenada Postal Corporation was established by Act 21 of 1996 which commenced on January 24th, 1997 to provide postal services on a strictly commercial basis. It operates forty-seven (47) sub-offices islandwide. According to the Act establishing the Grenada Postal Corporation, the Corporation: Internet Access, Post Shop, Advertise on Mail, Photocopy and Fax, Visa application online, Freight Forwarding, Stuff 'n' Seal, Direct Mail etc.","_name":"Grenada Post"},{"key":"07121","_canTrack":"1","_country":"0712","_url":"http://www.elcorreo.com.gt/","_detail":"The Courier has changed, the postal service in Guatemala change. We invite you to know us more closely, you see and perceive what we are doing, experiencing new and better ways of communication, trust us, our people, what we are and want to remain an admired Guatemalan company ... for each one of you ... our VISION: \"To be the service provider of postal communication more admired by our customers and for us, through developing effective innovation of our products and service solutions.\"  and our MISSION:  \"To know and understand our clients, fostering personal growth through the formation of values​​, adapting our processes according to the changes and needs of the market, to always provide timely and efficient service.\"","_name":"Correos Guatemala"},{"key":"07131","_canTrack":"0","_country":"0713","_url":"","_detail":"","_name":"Guinea Post"},{"key":"07141","_canTrack":"0","_country":"0714","_url":"http://guypost.gy/","_detail":"The first postal service was established in British Guiana by France in 1782. On 1783 \"Adrian Loncq was appointed the first Post Master for Demerara. On August 11, 1952, His Excellency the Governor Sir Charles Wooley on invitation of the Post Master General K.I.R. Kirkpatrick declared open the newly built General Post Office and Telecommunications Centre at its present location. On April 1st 1877, British Guiana entered the Postal Union. The Post Office, formerly part of the traditional Public Service became a Public Corporation on the 1st January 1977. It has a spread of over sixty (60) main Post Offices and several Postal Agencies throughout the length and breadth of the country.","_name":"Guyana Post"},{"key":"07161","_canTrack":"0","_country":"0716","_url":"","_detail":"","_name":"Postal"},{"key":"08011","_canTrack":"1","_country":"0801","_url":"http://www.hongkongpost.hk/","_detail":"Established in 1841, Hongkong Post enjoys a proud heritage and a long history of serving the community of Hong Kong. Since operating as a Trading Fund in 1995, Hongkong Post has managed to reinvent itself as a dynamic, customer-focused and market-oriented service organisation. Leveraging our extensive retail and distribution networks and a strong brand, we have grown beyond the traditional postal service to providing a wide and comprehensive range of services in the logistics supply chain, at the same time diversifying into new markets. We pledge to provide accessible, reliable and value-for-money postal services. I hope this homepage will provide you with user-friendly and interactive tools to access information not only about postal services and products, but also our corporate purpose, vision, mission and values. In addition, you can even make your purchase on our specially selected souvenirs, postal and philatelic products through our ShopThruPost shopping mall.","_name":"HongKong Post"},{"key":"08021","_canTrack":"0","_country":"0802","_url":"http://postehaiti.gouv.ht/","_detail":"The Post Office of Haiti: A New Vision: Restructuring, Modernization, Services and Quality Innovators! Offices of Haiti Post in the drawing to make the institution more efficient. Cooperation of Managers and employees to achieve this goal, its new slogan: \"The Office of Post Haiti even more efficient and even closer to you.\"","_name":"Haiti Post"},{"key":"08041","_canTrack":"1","_country":"0804","_url":"http://www.honducor.gob.hn/","_detail":"HONDUCOR is a legal entity entitled Decentralized Public-Private Sector of the Central Government, which operates basically generated by equity financing and counterparty transferred by the State for partial support of the 206 offices nationally pursuant to the agreement to United Nations to provide the Universal Postal Service (SPU) in the Honduran territories with the best possible quality. Being specialized company that provides postal services recognized and respected nationally and internationally, self-sufficient and competitive level that meets all locations of the country through its post, and promoter of modern technological innovation processes in their postal network surpassing well, expectations of domestic and foreign customers.","_name":"Correos de Honduras"},{"key":"08051","_canTrack":"1","_country":"0805","_url":"http://posta.hu/","_detail":"Magyar Posta is one of the biggest company groups and employers in Hungary.It has more than thirty thousand employees, 2,700 post offices, 350 mobile posts, a vehicle fleet of 3,000, a unique logistics network and an extensive services portfolio. On 1 January 2013, Hungary also joined the liberalized postal market of the European Union, so Magyar Posta is measured by each of its services at the competitive market today. By virtue of the agreement concluded with the Hungarian State, universal postal service provider's tasks shall be provided by Magyar Posta until 2020 in order to ensure that each citizen has access to basic services without discrimination. Magyar Posta operates a fleet of more than 3,000 vehicles. Vehicles are equipped with GPS tracking devices, ensuring optimal service planning and an intelligent parcel tracking system. Posta Autó Duna offers complex fleet management services not only for Magyar Posta but also for other companies on the market, including operation and maintenance. Our subsidiary JNT Security provides comprehensive cash logistics services, and Posta Biztosító is already a dominant player in the insurance market.","_name":"Magyar Post"},{"key":"09011","_canTrack":"1","_country":"0901","_url":"http://www.postur.is/","_detail":"The role of Iceland Post is to offer reliable services for companies and individuals in the field of distribution, communications and logistics, as well as other areas that pertain to these activities. It is Iceland Post's vision statement to be a progressive and powerfull company in mail and product distribution by providing a reliable and stable service around the country and the world, which is based on recognized quality standards. In addition, Iceland Post will work towards profitable growth with the interests of its customers, employees and owners as its goal. Iceland Post distribution network reaches all homes and businesses, 99,5% five days a week. Post offices and rural postmen provide customers with complete postal service regardless of location. Iceland Post operates internationally with other postal services and partner organisations postal services and partner organisations transporting products to and from Iceland, thus creating links with distribution systems all around the world. The company is one of the largest employers in the country with about 1000 employees. It is a young company, but its foundation has roots that reach back through 230 years of postal service in Iceland.","_name":"Iceland Post"},{"key":"09021","_canTrack":"1","_country":"0902","_url":"http://www.indiapost.gov.in/","_detail":"For more than 150 years, the Department of Posts (DoP) has been the backbone of the country's communication and has played a crucial role in the country's socio-economic development. It touches the lives of Indian citizens in many ways: delivering mails, accepting deposits under Small Savings Schemes, providing life insurance cover under Postal Life Insurance (PLI) and Rural Postal Life Insurance (RPLI) and providing retail services like bill collection, sale of forms, etc. The DoP also acts as an agent for Government of India in discharging other services for citizens such as Mahatma Gandhi National Rural Employment Guarantee Scheme (MGNREGS) wage disbursement and old age pension payments. With 1, 55,015 Post Offices, the DoP has the most widely distributed postal network in the world.","_name":"India Post"},{"key":"09031","_canTrack":"1","_country":"0903","_url":"http://ems.posindonesia.co.id/","_detail":"History records the existence of Pos Indonesia so long, the first post office was established in Batavia (now Jakarta) by the Governor-General Baron van Imhoff GW on August 26, 1746 with the aim to further ensure the safety of residents of the letters, especially for those who are trading from offices in outside Java, and for those who come from and go to the Netherlands. Since then, the postal service has been born to assume the role and function of public services. As time goes on, Pos Indonesia has now been able to show their creativity in the field of postal Indonesian development by utilizing its network infrastructure which reaches about 24 thousand point services reached 100 percent of city / county, nearly 100 percent of districts and 42 percent of the urban / rural, and 940 remote locations in the Indonesian transmigration. Along with the development of information, communication and technology, networking Pos Indonesia already has 3,700 post office line, mobile and equipped elektronic post in a few major cities. All points are chain connected to each other in a solid and integrated. ZIP code system was created to facilitate the processing of postal items where every inch of the area in Indonesia can be identified accurately.","_name":"Pos Indonesia"},{"key":"09034","_canTrack":"1","_country":"0903","_url":"http://www.posindonesia.co.id/","_detail":"History records the existence of Pos Indonesia so long, the first post office was established in Batavia (now Jakarta) by the Governor-General Baron van Imhoff GW on August 26, 1746 with the aim to further ensure the safety of residents of the letters, especially for those who are trading from offices in outside Java, and for those who come from and go to the Netherlands. Since then, the postal service has been born to assume the role and function of public services. As time goes on, Pos Indonesia has now been able to show their creativity in the field of postal Indonesian development by utilizing its network infrastructure which reaches about 24 thousand point services reached 100 percent of city / county, nearly 100 percent of districts and 42 percent of the urban / rural, and 940 remote locations in the Indonesian transmigration. Along with the development of information, communication and technology, networking Pos Indonesia already has 3,700 post office line, mobile and equipped elektronic post in a few major cities. All points are chain connected to each other in a solid and integrated. ZIP code system was created to facilitate the processing of postal items where every inch of the area in Indonesia can be identified accurately.","_name":"Pos Indonesia (Surface)"},{"key":"09041","_canTrack":"1","_country":"0904","_url":"http://post.ir/","_detail":"Iran is one of the world pioneers in rendering postal services which dates back to thousands years ago. The modern post was launched more than one-hundred and fifty years ago by Amir Kabir. The deep experience and knowledge of postal services led to Iran Post to be corporate in 1988.  The objective lied in provision of facilities to render postal services to the public, to expand the scope of postal services, to plan, launch, equip and expand post offices based on recent technology based advancements. Recently Iran Post entered into a new phase of transformation i.e. privatization; the regulatory and operatory body will be separated, and the operatory body will be initially offered in the stock market. The investment is left open to all whether international inventors or domestic ones. Presently Iran Post has an obligation to provide postal services to a population as much as seventy millions, and this mandate will be kept after privatization. We have an extended network of post offices and staff; the details will be explained at the relevant section.","_name":"Iran Post"},{"key":"09051","_canTrack":"1","_country":"0905","_url":"http://www.anpost.ie/","_detail":"An Post is a major commercial organisation providing a wide range of services which encompass postal, distribution and financial services. It is one of Ireland's largest companies directly employing over 9,600 people through its national network of retail, processing and delivery points. It provides agency services for Government Departments, the National Treasury Management Agency, An Post National Lottery Company and many other commercial bodies. The company is a limited liability company, incorporated under the Companies Act, 1963 to 1983. Under the Postal and Telecommunications Services Act, 1983, the Company is entitled to omit the word - 'Limited' from its name. One ordinary share is held by the Minister for Finance and the remainder of the issued share capital is held by the Minister for Communications, Energy and Natural Resources. Details of the activities carried on by subsidiary, associated and joint venture undertakings, together with the information required by Section 158 of the Companies Act, 1963, are given in note 24 of the financial statements. Details of the results for the year are set out in the consolidated profit and loss account and in the financial statements.","_name":"An Post"},{"key":"09061","_canTrack":"1","_country":"0906","_url":"http://www.israelpost.co.il/","_detail":"The Israel Postal Company stands a top the Israeli marketplace, providing a variety of services to the public via its well skilled and knowledgeable staff, using advanced technology to improve the service and the work methods. The Israel Postal Company has the largest deployment of service units throughout Israel. In 2011 The Israel Postal Company turnover reached NIS 1.780 billion. The Israel Postal Company provides universal postal service to the general population, under the motto \"From everyone, to everyone, everywhere, everyday, and at an equal price to all\". Every day 1,650 professional postal delivery personnel visit every household and business in the country and 2,000 service representatives provide a variety of about 100 innovative and online products and services though the largest branch network in Israel. The company has a team of professional salespeople who provide business and postal solutions to all sectors of the economy. The Israel Postal Company is proud of its involvement in the community and its participation in social projects.","_name":"Israel Post"},{"key":"09071","_canTrack":"1","_country":"0907","_url":"http://www.poste.it/","_detail":"Postel brand was founded in 1987  by the collaboration between the Italian Postal Service and Elsag: the first service launched in the market was the Hybrid Electronic Mail, highly innovative solution designed for the outsourcing of mandatory mail through electronic platform. The company imposes itself successfully on the market and in May 1999 was founded Postel SpA, in 2001 the Italian Postal Service decided to become the only shareholder acquiring 100% of the company. Postel today is a highly technological company able to meet the needs of each company or public body, providing customized solutions, streamlining processes and reducing costs.","_name":"Poste Italiane"},{"key":"09081","_canTrack":"0","_country":"0908","_url":"http://www.iraqipost.net/","_detail":"The Iraqi Telecommunication and Post Company (ITPC) is a government-owned and operated corporation responsible for providing telecommunication and mail services in Iraq.","_name":"Iraqi Post"},{"key":"10011","_canTrack":"1","_country":"1001","_url":"http://www.jamaicapost.gov.jm/","_detail":"Jamaica's postal service is the responsibility of the Post and Telecommunications Department, a Department under the Ministry of Science, Technology, Energy and Mining. The Post Office is headquartered at the Central Sorting Office on South Camp Road in Kingston and constitutes a network of Post Offices and Postal Agencies across the country. The Postmaster General of Jamaica, who is assisted by two Deputies and a senior management team, leads the Department. Operational control is achieved through a team of 11 Regional Managers. Post Offices offer a full range of postal services including the acceptance and delivery of mail and the sale of postage stamps. Our opening hours are 8:00 a.m. to 5:00 p.m. Mondays to Fridays. Postal Agencies however, operate on a part-time basis, offering a restricted range of postal services.","_name":"Jamaica Post"},{"key":"10021","_canTrack":"1","_country":"1002","_url":"http://www.post.japanpost.jp/","_detail":"Japan Post was a government-owned corporation in Japan, that existed from 2003–2007, offering postal and package delivery services, banking services, and life insurance. It had over 400,000 employees and ran 24,700 post offices throughout Japan and was the nation's largest employer. One third of all Japanese government employees worked for Japan Post. As of 2005, the president of the company was Masaharu Ikuta, formerly chairman of Mitsui O.S.K. Lines Ltd. Japan Post ran the world's largest postal savings system and was often said to be the largest holder of personal savings in the world: with ¥224 trillion ($2.1 trillion) of household assets in its yū-cho savings accounts and ¥126 trillion ($1.2 trillion) of household assets in its kampo life insurance services, its holdings account for 25 percent of household assets in Japan. Japan Post also held about ¥140 trillion (one fifth) of the Japanese national debt in the form of government bonds. On October 1, 2007 Japan Post was privatized following fierce political debate that was settled by the 2005 general election. After the privatization, the Japan Post Group companies operate the postal business. Later in 2010, the privatization was put on hold, and the Japanese Ministry of Finance remains the 100% shareholder.","_name":"Japan Post"},{"key":"10031","_canTrack":"1","_country":"1003","_url":"http://www.jordanpost.com.jo/","_detail":"In 2002, the Postal Services Act was passed by the National Assembly and named (the Postal Services Law No. 34 for the year 2007), under which the Jordan Post Company was established as the public postal operator and started to function as such on January 1, 2003; whereas the Ministry of Post and Telecommunications was renamed as the Ministry of Communications and Information Technology. It is worth mentioning that the current number of postal offices available in the kingdom is 356 Post Offices. Jordan Post continues to provide postal services for all citizens and the beneficiaries, whether the same being basic postal or financial services, or on behalf of other institutions, departments and companies in the public and private sectors including communications companies, particularly services relevant to collection of  invoices as well as telegram and telephone booth service in addition to other services.","_name":"Jordan Post"},{"key":"11011","_canTrack":"1","_country":"1101","_url":"http://www.kazpost.kz/","_detail":"Kazakhstan post has a long historic tradition. On 25 December 1954m the Administration of Commissioner of the USSR Ministry of Communication was transformed into the Ministry of Communication of the Kazakh Soviet Socialist Republic. Postal and electric means of communication were united into one industry called Communication, which industry was delegated under the jurisdiction of the new Ministry.  There were 4,000 postal enterprises operating in Kazakhstan in the middle 60-s of the XX Century.  They delivered the full spectrum of postal services to population.  During that period, the national post was profitable and all revenues were invested into development of electric communication.  The main part of incomes was raised from delivery of pensions and telephone and telegraph services.  In March 1946, the Commissioner of the Popular Commissariat of Communication of USSR under Kazakh Soviet Socialist Republic Council of People's Commissars was renamed into Commissioner of the USST Ministry of Communication under the Council of Ministers of the Kazakh Soviet Socialist Republic.  In 1950, there were 2,438 postal enterprises in Kazakhstan, including 2,038 in  the rural areas.","_name":"Kaz Post"},{"key":"11021","_canTrack":"1","_country":"1102","_url":"http://www.posta.co.ke/","_detail":"The Post in Kenya currently cooperates with other postal administrations within East Africa in the provision of Postal Money Transfers through the UPU's electronic International Financial System (IFS). It also has the International Postal System (IPS) that enables track and trace facilities for mail and EMS within UPU member countries. A number of neighbouring postal administrations use Nairobi as their transit point for international mail. Postal Corporation of Kenya in this connection has plans of putting up a modern International Mails Transit Centre at the Jomo Kenyatta International Airport (JKIA), Nairobi.","_name":"Kenya Post"},{"key":"11031","_canTrack":"1","_country":"1103","_url":"http://www.royalmail.com/","_detail":"Royal Mail is the UK's designated Universal Postal Service Provider, supporting customers, businesses and communities across the country. We are the only company that has the capability to deliver a 'one-price-goes-anywhere', six-days-a-week service on a range of letters and parcels to more than 29 million addresses across the UK. General Logistics Systems (GLS), our European parcels business, operates one of the largest ground-based, deferred parcel delivery networks in Europe. In October 2013, Royal Mail successfully floated on the London Stock Exchange and was subsequently admitted into the FTSE 100. More than 700,000 members of the public bought shares in Royal Mail. These investors were joined by the overwhelming majority of our people in the UK, who in total received free a ten per cent stake in our company.","_name":"Royal Mail"},{"key":"11033","_canTrack":"1","_country":"1103","_url":"http://www.parcelforce.com/","_detail":"Over 25 years in the making we've a long history as part of the Royal Mail Group, but in 1986 Royal Mail created a separate parcel function forming the foundations of the business we know today. In 1990 Royal Mail Parcels was rebranded to Parcelforce, along with a massive investment in IT and infrastructure with the introduction of online tracking and the construction our National and International sorting hubs. Then in 1998 the business was rebranded to Parcelforce Worldwide. The last decade has seen us move into the express parcels market with further investment in technology which enables us to provide our exceptional quality of service. In 2013 we continued investing in the future of our business, enabling us to further enhance our network with 12 new and improved depots. Along with building a brand new processing centre in the North West with industry leading technology; ensuring that we can continue to handle your parcels with greater speed and precision, so we are best placed to meet the rapid growth in demand within the express parcels market.","_name":"Parcelforce"},{"key":"11041","_canTrack":"0","_country":"1104","_url":"","_detail":"","_name":"Postal"},{"key":"11051","_canTrack":"1","_country":"1105","_url":"http://www.epost.go.kr/","_detail":"Korea EPost is the national postal service of South Korea, under the authority of the Ministry of Science, ICT and Future Planning, formerly Ministry of Knowledge Economy until 2013. Korea Post is in charge of postal service, postal banking and insurance services. Its headquarters is in the Gwanghwamun Post Office, near the MIC Building on Sejongno in Seoul. The cyber market place that offer goods or service to the user and trade each other by information technique tool with Korea Post Sets. The cyber post portal site that offers post service conveniently and safely such as Postal, Shipping, EMS, Shopping, Open market which provide services from the post office via internet without visiting post office. The ePOST offers an integrated account (ID and password) which can use ePOST services, and in the near future, develop new services which combines information technique continuously for customer service improvement and realize the new post office model in the internet times. 24 hours and 365 days, there is non-stop service substitute for the post office, and there is various business connection with Post-Net. At any time, any where you can use ePOST if internet is available so there is no restriction of time and space.","_name":"Korea Post"},{"key":"11061","_canTrack":"0","_country":"1106","_url":"","_detail":"","_name":"Postal"},{"key":"11071","_canTrack":"0","_country":"1107","_url":"http://www.postakosoves.net/","_detail":"On 21st December 2006, the Post and Telecommunications of Kosovo J.S.C. celebrated the 47th anniversary of foundation. The Post, Telephone and Telegraph of Kosovo were established in 1959 under a Decision no. 1115497/1-1959 of the Steering Council of Yugoslavian PTT Communion. At that time, postal services were infeasible whereas the Telephony and Telegraphy of Kosovo as well as international connections were almost inoperative. After 6 years of efforts, PTK has established following three business units: Post of Kosovo, Telecom of Kosovo, and Vala mobile network operator. These three business units of the PTK are licensed by the Kosovo Telecommunications Regulatory Authority. On 29 June 2005, PTK was transformed into a joint-stock-company under the new name of PTK J.S.C. PTK J.S.C. has actually a five years business plan with an investment of 550 million euros.","_name":"Kosovo Post"},{"key":"11081","_canTrack":"0","_country":"1108","_url":"http://moc.kw/","_detail":"The enormous development that happened in the field of telecommunications, mail and telephones in Kuwait resulted from huge and fruitful efforts by the officials who worked on that development to support and enhance the services and the works of the ministry They are consequently presenting services to the Kuwaiti people and push the wheel of progress in the state of Kuwait. The services of post , telegraph and telephones as a whole represent one of  the most effective means in any society towards increasing its development and decreasing its regression. This is because of the availability of services and the means of communications whether internal or external. The role of the ministry considered as an important role through supporting the life of people's  interdependence and exchange benefits , ideas and cultures. The services which are presented by the ministry became one of the basic standards in measuring the civilization level in our dearest country Kuwait. The telecommunications passed through different stages of progress that cope with human development which work on human welfare and luxury.","_name":"Kuwait Post"},{"key":"11091","_canTrack":"1","_country":"1109","_url":"http://kyrgyzpost.kg/","_detail":"In 1992, Kyrgyzstan joined the international organization \"Universal Postal Union\", which brings together 191 countries around the world. Between the two countries at the level of the postal administrations of the existing interstate agreements. Ministry of Transport and Communications of the Kyrgyz Republic is a regulator, the State Enterprise \"Kyrgyzpochtasy\" is the operator for the provision of postal services. State postal service in the face of the State Enterprise \"Kyrgyzpochtasy\" occupies an important place in the structure of the communications industry and infrastructure in the region of the Kyrgyz Republic has the most extensive in the country a network of regional branches and post offices - 922 sites across the country and is a self-supporting economic entity with the status of a single legal entity.","_name":"Kyrgyz Post"},{"key":"11094","_canTrack":"1","_country":"1109","_url":"https://www.kep.kg/","_detail":"Kyrgyz Express Post LLC (KEP) has been operating in the postal market of Kyrgyzstan since 16 March 2012 under the license no. 12-917-КР granted by the State Communication Agency of the Government of the Republic of Kyrgyzstan, providing a wide range of postal, financial and other services both to individuals and legal entities.","_name":"Kyrgyz Express Post"},{"key":"12011","_canTrack":"0","_country":"1201","_url":"http://www.laopost.com.la/","_detail":"","_name":"Enterprise des Poste Lao"},{"key":"12014","_canTrack":"1","_country":"1201","_url":"http://www.laopostvte.com/","_detail":"","_name":"Enterprise des Poste Lao (VTE)"},{"key":"12015","_canTrack":"1","_country":"1201","_url":"http://www.laopostepl.com/","_detail":"","_name":"Enterprise des Poste Lao (EPL)"},{"key":"12021","_canTrack":"1","_country":"1202","_url":"http://www.pasts.lv/","_detail":"Latvian Post is a modern, on business fundamentals-based company, which effectively competes postal market with a solid reputation for high standards of customer service and motivated employees. Together with partners, we are constantly evolving, diversifying and expanding our services throughout the reception on Latvian territory. Our services are available to customers, easy and affordable. Delivered to the postal item is a great value, which invested in many people's work. Our resources provide high quality standards: motivated employees, a unique post office and transport network, advanced technologies. We are responsive, accommodating and offer the best and most convenient solutions for each individual customer.","_name":"Latvia Post"},{"key":"12031","_canTrack":"1","_country":"1203","_url":"http://www.libanpost.com/","_detail":"LibanPost's persistent efforts gaining it the reputation of an efficient, quality-conscious, and accessible service provider. Throughout its young history, it has won several accolades, including the 2006 SuperBrand award for Brand Excellence, as well as the 2010 World Mail awards for both Innovation and Transformation, not to mention its selection as the Best Socially Interactive Platform for its innovative use of its Facebook page and Tatweej Academy award for excellence, Best Corporate Award from the Arab Organization for Social Responsability. In a country facing many challenges, LibanPost chooses to confront these issues and, through a winning combination of commitment and innovation, turn them into tangible opportunities for growth and development. Indeed, its goal is to become an essential partner that facilitates the day-to-day workings of today's world, determined unceasingly to fulfill every customer's expectation. More importantly, LibanPost aspires to being the right solution, no matter what situation may arise, transforming itself from a simple mail delivery service to becoming an intrinsic part of people's daily life.","_name":"Liban Post"},{"key":"12041","_canTrack":"1","_country":"1204","_url":"http://lesothopost.org.ls/","_detail":"Lesotho Postal Services will achieve sustained profitability through being the supplier (carrier) of choice for messages, goods and payments for all the people of Lesotho, their families and businesses.Our Values:Honesty – our aim is to be the most trusted organization in LesothoReliability – we will take the steps necessary to ensure all messages, goods and payments in our care arrive on time and in good orderAccountability – we will do what we say we will doEffectiveness and Efficiency – we are committed to providing straightforward, timely and high quality products and servicesProactive – we shall be a step ahead of our competitors while also anticipating our customers' needsResults Oriented – we will strive to succeed in all that we doFriendly – we will remember who we are, where we come from and the value of a smile","_name":"Lesotho Post"},{"key":"12051","_canTrack":"0","_country":"1205","_url":"http://www.mopt.gov.lr/","_detail":"","_name":"Liberia Post"},{"key":"12061","_canTrack":"0","_country":"1206","_url":"http://libyapost.ly/","_detail":"Libya Post Company is a Libyan joint stock company having its legal personality and independent financial liability. It is affiliated to the Holding Libyan Post, Telecommunication and Information Technology Company. The Company aims to establish, operate, manage and organize all kinds of different post services including mail financial services at home and foreign level, services and products marketing for public and private bodies and any complementary activity meeting the purposes of the Company.","_name":"Libya Post"},{"key":"12071","_canTrack":"0","_country":"1207","_url":"http://www.post.li/","_detail":"19 February 1999: The Liechtenstein Post AG is founded. June 1999: The Liechtenstein Post AG is entered in the commercial register. Other milestones include the acquisition of staff and the appointment of directors as well as negotiations with the Swiss post office, with the aim of ensuring the very good cooperation in the future. Since 1 January 2000 the Liechtenstein Post AG is completely independent and a market economy structures oriented, modern and profitable Dienstleistungsunternehmen.23. June 2005: 25 percent of the shares are acquired by the Swiss Post.","_name":"Liechtenstein Post"},{"key":"12081","_canTrack":"1","_country":"1208","_url":"http://www.post.lt/","_detail":"AB Lietuvos paštas, a public limited company, is the largest provider of postal services in Lithuania. Boasting long-lasting traditions and professional service, the company has earned the public's trust. The services rendered by the team of professionals are used by almost 800,000 customers each month. With the introduction of innovative management solutions today we offer our customers not only postal, but also courier and financial intermediation services.","_name":"Lithuania Post"},{"key":"12091","_canTrack":"1","_country":"1209","_url":"http://www.stluciapostal.com/","_detail":"Saint Lucia Postal Service does not operate in isolation, and is one of the 191 members of the Universal Postal Union, a United Nations specialized agency. The Universal Postal union was established in 1874, has its headquarters in Berne Switzerland. Saint Lucia Postal Service is also a member of the Caribbean Postal Union which was established in Saint Lucia in September 1997, where 15 Caribbean postal administrations signed the CPU conventions and protocols. To date there consists of 24 Caribbean territories plus the United States, United Kingdom, France, Canada and Netherlands. The secretariat for the regional coordinator for the Universal Postal Union and the technical officer for the Caribbean Postal Union, is based at General Post office, Castries, St. Lucia.","_name":"Saint Lucia Post"},{"key":"12101","_canTrack":"1","_country":"1210","_url":"http://www.post.lu/","_detail":"POST Group Luxembourg is the country's 3rd largest employer, with nearly 4,000 staff working for the company and its subsidiaries. It has a well-established reputation and is firmly rooted in Luxembourg. It is also an innovative company that adopts an open-minded approach to the world thanks to its constantly evolving activities and the diversity of its staff, who represent more than 28 different nationalities. POST Luxembourg was founded in 1842 as a public service and has been a wholly state-owned company since 1992 (Entreprise des Postes et Télécommunications). It is the country's largest provider of postal and telecommunications services and also offers financial and philatelic services.","_name":"Luxembourg Post"},{"key":"13011","_canTrack":"1","_country":"1301","_url":"http://www.macaupost.gov.mo/","_detail":"Macao Post has defined the following guiding principles for its policy of Philatelic issues: Thematic Diversity, Credibility and Responsibility, and Product Quality. Macao Post published six Philatelic Catalogues with details of all products issued since the establishment of Macao Special Administrative Region (MSAR). Macao Post, responding to users' concerns when doing transactions on the Internet, introduced, through the eSignTrust services, the Qualified Electronic Signature, which follows international security standards. This signature, using a secure device and complying with internationally recognized norms, has its Integrity, Confidentiality and Non-Repudiation guaranteed. It is recommended for accessing online services provided by Banks, Private Companies and the Government. Macao Post is committed to promoting and continuously improving the interoperability, quality and efficiency of the Physical, Electronic and Financial Postal Networks all over the world.","_name":"Macau Post"},{"key":"13021","_canTrack":"1","_country":"1302","_url":"http://www.posta.mk/","_detail":"International postal services in the Republic of Macedonia began operations on 1 June 1992., When GCP Skopje 2 form izmenichnata mail Skopje 91,003 that was used in the overall concentration of shipments from overseas and through two departments. The process of dividing the former PTT \"Macedonia\" started under the agreement with EBRD was especially intense at the end of 1996/97 year. Since 1 January 1997. PE \"Macedonian Post\" is already functioning as a separate enterprise. Macedonian mail with more than 2000 employees and over 300 units of the postal network in the whole territory of the Republic of Macedonia employed in public service in domestic and international postal services, pursuant to the Postal Service.","_name":"Macedonia Post"},{"key":"13031","_canTrack":"0","_country":"1303","_url":"","_detail":"","_name":"Postal"},{"key":"13041","_canTrack":"0","_country":"1304","_url":"http://www.malawiposts.com/","_detail":"Malawi Posts Corporation (MPC) was established as a Statutory Corporation in June 2000 under the Communications Act Number 41 of 1998. The Act mandates MPC to provide postal and financial services and any other services incidental to transmission of postal articles. The Corporation is regulated by Malawi Regulatory Authority (MACRA) under a license which came into operation in 2003. MPC has a wide network of 180 Post Offices country wide. The postal network is further enhanced by 154 postal agencies countrywide which fall under the jurisdiction of District Assemblies.","_name":"Malawi Post"},{"key":"13051","_canTrack":"1","_country":"1305","_url":"http://www.pos.com.my/","_detail":"Pos Malaysia Berhad is Malaysia's premier postal service provider. We have a widespread network of over 1,000 touch points countrywide that includes Pos Malaysia Outlets, Pos Minis, Pos24 (Self Service Terminals), Post-On-Wheels (Mobile Outlets), postal agents and stamp agents, making it one of the most extensive retail network in Malaysia. Throughout the years, Pos Malaysia has grown from strength to strength and is progressing from being a mail and postal services provider towards becoming a dynamic communications, financial services and supply chain solutions provider. Moving forward, Pos Malaysia will continue to transform and innovate itself in order to maintain its relevance and competitive edge as well as continue to connect Malaysians with the rest of the world.","_name":"Pos Malaysia"},{"key":"13061","_canTrack":"1","_country":"1306","_url":"http://www.maldivespost.com/","_detail":"Maldivian postal service became a member of UPU on 15th August 1967, the organization of international postal administrations. On 1st July 1982 it became a member of Asia Pacific Postal Union, the organization of Asia Pacific Postal Organisations. On 13th June 1993 as a step taken to improve the postal services to the rest of the atolls, Atolls Post Centre was opened to centralize the mail exchange with the captains of the boats that traveled between the capital and the rest of the atolls. On 10th February 1994 introduction to electronic data interchange for the purpose of track and trace of postal items. Our vision is to provide a high quality mail service and other services at a standard and quality acceptable to all citizens an postal customers. To meet our customer's changing needs by providing new and innovative products and services through friendly and knowledgeable taff and efficient networks.","_name":"Maldives Post"},{"key":"13071","_canTrack":"0","_country":"1307","_url":"http://www.laposte.ml/","_detail":"La Poste du Mali is the company responsible for postal service in Mali. We operate Postal Mail: send mail safely and promptly. Parcel Post: Send your freight shipments in the safest conditions at destination. The Po Box: Anyone with a home or having an industrial or commercial establishment in the postcode of a post office can purchase a subscription allowing him to withdraw his letter in a special box called PO Box or trade. The Postal Mandate: The mandate is considered as an order to pay. Is called mandate any security issued or paid by a post office for the execution of transfer of funds. The Post-Fax: is the email from the mail. It allows instant mail forwarding a fax machine called Fax.","_name":"La Poste De Mali"},{"key":"13081","_canTrack":"1","_country":"1308","_url":"http://www.maltapost.com/","_detail":"MaltaPost p.l.c. is Malta's leading postal services company, being the sole licensed Universal Service Provider of postal service in the Maltese Islands. It is one of the country's largest private employers and as the national postal operator, it collects and delivers mail to every address on the Islands, 6-days-a-week and operates through a comprehensive retail network of outlets. It is regulated by the Malta Communications Authority and is listed on the Malta Stock Exchange. MaltaPost has developed a state-of-the-art document management centre in Xewkija, Gozo which is equipped to scan, archive and index information of both electronic and physical formats.","_name":"Malta Post"},{"key":"13101","_canTrack":"0","_country":"1310","_url":"","_detail":"","_name":"Postal"},{"key":"13121","_canTrack":"0","_country":"1312","_url":"http://www.mauripost.mr/","_detail":"Mauritanian Post Office Company was created on 29th December 1999 when the Post Office Telecommunications  (opt) was split up into two companies. According to the decree n°99-157/MP/MIPT dated 29th December 1999 that created it, Mauripost is responsible for providing postal services in Mauritania.","_name":"Mauritanian Post"},{"key":"13131","_canTrack":"1","_country":"1313","_url":"http://www.mauritiuspost.mu/","_detail":"The Mauritius Post is the company responsible for postal service in Mauritius. Our vision is: To be recognised as a world class provider of postal and communication related services in the region. And our mission is: To provide access to an array of services across the country including postal, electronic information, financial and government related services through a wide network of branches.","_name":"Mauritius Post"},{"key":"13141","_canTrack":"1","_country":"1314","_url":"http://www.correosdemexico.gob.mx/","_detail":"In 1878, the Mexican Post was invited to join the Universal Postal Union, joining said institution on 1 April 1879. Later, on 1 January 1884, the First Postal Code and Rules take effect, and in 1895 they are subsequently replaced by the second Postal Code. Our broad scope covers 98% of the Mexican Republic, including 29,000 service sites, over 2800 land routes and more than 15,000 collaborators who offer quality services, all of which give us standing as one of the most important distribution services in Mexico. Backed by tradition and experience, Correos de México is a cutting-edge institution that keeps abreast of rapidly evolving technology. We have reinvented our operating processes to respond to ever more increasing market challenges that demand quality at competitive prices; proof of which are our prices: the lowest in the market, making us the best cost-benefit choice in the market. This is why with Correos de México your parcel Te Llega/Gets to You and with Mexpost it gets there faster.","_name":"Mexico Post"},{"key":"13151","_canTrack":"0","_country":"1315","_url":"","_detail":"","_name":"Postal"},{"key":"13161","_canTrack":"1","_country":"1316","_url":"http://www.posta.md/","_detail":"State Enterprise \"Posta Moldovei\" was founded on 1 April 1993, as a result of division of postal communications sector from telecommunications one. It is the national operator in the field of postal services, represented by the Ministry of Information Technology and Communications. Posta Moldovei is the largest operator of this kind in Moldova and offers a wide range of postal and financial services throughout the country, having a territorial network of 1146 offices and postal agencies, 37 branches, providing postal services in 1527 localities of the country. To become a leading company in the market for the provision of postal services, we always try to keep step with advanced technologies, enabling us to offer our customers modern services and complex solutions.","_name":"Moldova Post"},{"key":"13171","_canTrack":"0","_country":"1317","_url":"http://www.lapostemonaco.mc/","_detail":"The Principality of Monaco, situated between Liguria and Antibes, experiencing significant postal traffic in the middle of the seventeenth century. The first known date postmarked 1704.  Monaco's postal service is provided by France following the Franco-Monegasque Treaty of Friendship Peronne in 1640, signed by King Louis XIII and Prince Honoré II. Moreover, the Principality, whose territory extended to Roquebrune and Menton, two cities that have seceded in 1848, was reduced to its present boundaries by the Franco-Monegasque Treaty of February 2, 1861 between the Emperor Napoleon III and Prince Charles III. Convention vicinity of November 9, 1865, in effect, identifies issues relating to the postal service.","_name":"La Poste De Monaco"},{"key":"13173","_canTrack":"0","_country":"1317","_url":"http://www.lapostemonaco.mc/","_detail":"The Principality of Monaco, situated between Liguria and Antibes, experiencing significant postal traffic in the middle of the seventeenth century. The first known date postmarked 1704.  Monaco's postal service is provided by France following the Franco-Monegasque Treaty of Friendship Peronne in 1640, signed by King Louis XIII and Prince Honoré II. Moreover, the Principality, whose territory extended to Roquebrune and Menton, two cities that have seceded in 1848, was reduced to its present boundaries by the Franco-Monegasque Treaty of February 2, 1861 between the Emperor Napoleon III and Prince Charles III. Convention vicinity of November 9, 1865, in effect, identifies issues relating to the postal service.","_name":"La Poste De Monaco"},{"key":"13181","_canTrack":"1","_country":"1318","_url":"http://www.mongolpost.mn/","_detail":"","_name":"Mongol Post"},{"key":"13191","_canTrack":"1","_country":"1319","_url":"http://www.postacg.me/","_detail":"The Montenegrin government decision 03-11340 / 7 of 17.11.2011. The restructuring is carried out from Montenegro to changes in the organizational form of the joint stock company. Previously, Post Montenegro d.o.o. - Limited Liability Company Podgorica, organized by a decision of the Board of Directors JP PTT of Montenegro on the division of the Company on a post Montenegro Ltd. and Telecommunications of Montenegro A.D. (Decision no. 08-7420 of 28.10.1998. Yrs.), To which the Government of the Republic of Montenegro gave consent decision on approving the status change from JP PTT of Montenegro (Official Gazette of RM no. 40/98). The Company is a legal successor of JP PTT Montenegro in the performance of registered postal services. Mail Montenegro's most important business network in the country whose social mission organizations postal services as a universal postal operator, with the continuous development of new, profitable services in accordance with the requirements of the modern market.","_name":"Montenegro Post"},{"key":"13211","_canTrack":"1","_country":"1321","_url":"http://www.poste.ma/","_detail":"The Morocco Post group has largely evolved over the past decade: our site had to change to best meet the community needs of our customers and prospects, partners and anyone interested in our group and our activities . The goal was to create a site with relevant Group activities while demonstrating originality and inventiveness graphics. Like the Poste Morocco, this new portal is both singular and plural, but also user-friendly, practical and informative. Although this portal aspires to inform, but also to serve you: you will find lots of useful information about our rates, our agencies, online services etc. Our portal aims to go your way, to be a place of exchanges with all our audiences, Please be sure to check and to subscribe to our newsletter monthly electronic newsletter, to to miss any news Poste Morocco.","_name":"Morocco Post"},{"key":"13221","_canTrack":"0","_country":"1322","_url":"http://www.correios.co.mz/","_detail":"The company Post of Mozambique can still carry on commercial, industrial and financial related directly or indirectly to their core business activities. The National Postal Company of Mozambique, EP, hereinafter called the Post Office in Mozambique, EP, is a public company with legal personality and administrative and financial autonomy, exercising their activity on subordination of the Ministry of Transport and Communications. Governed by the law of public companies, by its statutes, the laws and regulations that are specifically applicable to it as a provider of public services and, finally, what is not specifically regulated by the rules of private law. The public interest defense that will guide all activities of the company will be ensured by the Government, through the Minister of Transport and Communications, except where you are expressly defined otherwise in law or its constitution.","_name":"Correios de Moçambique"},{"key":"13231","_canTrack":"0","_country":"1323","_url":"http://www.myanmaposts.net.mm/","_detail":"Myanmar Post and Telecommunication (MPT) is a state owned enterprise in Myanmar under the supervision of Ministry of Communication and Information Technology. It monopolizes the mobile and land line phone communication, internet service providing and postal service until 2013. Telenor Group of Norwegian and Ooredoo of Qatar are granted licenses to operate nationwide network including mobile and internet for 15 years in 2013.","_name":"Myanma Post"},{"key":"14011","_canTrack":"1","_country":"1401","_url":"http://www.nampost.com.na/","_detail":"Namibia Post Ltd (NamPost) is the national Postal operator in Namibia providing service solutions through its postal, banking, courier, philately, agency and money transfer services. NamPost has a long history of serving Namibians. As a government department before Independence and a commercialised entity after 1992, NamPost has served the people of Namibia for 119 years. From humble beginnings, it has extended its reach throughout the country and today provides a comprehensive service to customers from more than 130 post offices countrywide.","_name":"Namibia Post"},{"key":"14021","_canTrack":"0","_country":"1402","_url":"","_detail":"","_name":"Postal"},{"key":"14031","_canTrack":"0","_country":"1403","_url":"http://www.gpo.gov.np/","_detail":"Nepal General Post Office (GPO) is situated at Sundhara, Kathmandu, Nepal. It provides the following services: Express Mail Service (EMS); Under EMS, International EMS is cheap and reliable;Parcel Service; Post Box Service & its Online Post Box Service; Postal Banking Service; Letter; More services.Our vision: Linking people, their communities and business by providing high quality postal services. And our mission: Ensuring the highest levels of customer satisfaction through the use of new technology; Becoming operationally excellent and efficient; Anticipating changes and responding proactively; Fulfilling social obligations.","_name":"Nepal Post"},{"key":"14041","_canTrack":"0","_country":"1404","_url":"http://postnlparcels.com/","_detail":"For a long time, PostNL was the only postal company in the Netherlands. PostNL has the two large TNT divisions, Mail and Express, grew apart more and more, each with their own strategies. In 2011, TNT Express separated, and the postal company continued as PostNL. We are a company that deals in letters, parcels and everything related to letters and parcels. We also work in Belgium, Luxembourg, the United Kingdom, Germany and Italy. We live in a world where digital applications play an increasingly large role in our daily lives. These services develop very rapidly. We put our resourcefulness to good use to constantly think up new ways to connect senders and receivers. We have been delivering your mail for more than 200 years, in the Netherlands and abroad. We are an essential link between the physical and the online world. We have the largest network for letters, parcels and e-commerce in the Benelux countries. Our combinations of smart networks and digital applications enable us to provide our clients with valuable solutions.","_name":"PostNL"},{"key":"14044","_canTrack":"1","_country":"1404","_url":"http://www.postnl.post/","_detail":"For a long time, PostNL was the only postal company in the Netherlands. PostNL has the two large TNT divisions, Mail and Express, grew apart more and more, each with their own strategies. In 2011, TNT Express separated, and the postal company continued as PostNL. We are a company that deals in letters, parcels and everything related to letters and parcels. We also work in Belgium, Luxembourg, the United Kingdom, Germany and Italy. We live in a world where digital applications play an increasingly large role in our daily lives. These services develop very rapidly. We put our resourcefulness to good use to constantly think up new ways to connect senders and receivers. We have been delivering your mail for more than 200 years, in the Netherlands and abroad. We are an essential link between the physical and the online world. We have the largest network for letters, parcels and e-commerce in the Benelux countries. Our combinations of smart networks and digital applications enable us to provide our clients with valuable solutions.","_name":"PostNL International Mail"},{"key":"14061","_canTrack":"1","_country":"1406","_url":"http://www.nzpost.co.nz/","_detail":"New Zealand Post Group consists of a range of businesses providing communication and business solutions. From the core mail business through to banking and digital solutions, New Zealand Post Group is a vibrant and evolving organisation. The New Zealand Post Board oversees the performance of the Group which is managed by an executive team. New Zealand Post delivers more than 800 million items of mail a year to approximately 1.9 million homes, businesses, rural delivery addresses and private boxes around the country. Express Couriers Ltd, through its brands CourierPost, Pace, Contract Logistics and Roadstar, is New Zealand's leading express courier, logistics and distribution business – providing customers with a complete solution to meet all their supply chain needs. With more than 650 uniformed couriers delivering over 43 million courier parcels each year – Express Couriers with its distinctive yellow trucks, vans and bikes has become the partner of choice for many New Zealand businesses.","_name":"New Zealand Post"},{"key":"14071","_canTrack":"1","_country":"1407","_url":"http://www.correos.gob.ni/","_detail":"Correos de Nicaragua is a corporation incorporated in 1993 under the guise of a corporation whose capital is owned by the executive branch of the State of Nicaragua, Correos de Nicaragua is governed by private law and operates in the domestic market in the postal sector. We are the leading domestic company in the distribution of ordinary and business mail, packages and parcels; aimed at the modernization and strategic direct distribution. We have a team of experienced and highly committed to the goals of our clients. We are the only company in the industry offering 12 services in general. Members of the world's largest postal network with 189 member countries affiliated to the Universal Postal Union (UPU).","_name":"Nicaragua Post"},{"key":"14081","_canTrack":"1","_country":"1408","_url":"http://www.posten.no/","_detail":"Posten Norge is a Nordic mail and logistics group that develops and delivers complete solutions within postal services, communications and logistics, with the Nordic area as its local market. The Group has over 20 000 talented and quality-conscious employees who live to deliver and find new paths. Continuous improvement shall be the hallmark of our business. The Group has more than 1 400 points of sale in Norway in the form of post offices and Post in Shops. Posten Norge meets the markets with two brands , Posten and Bring, Posten covers services to private customers, the post office network and daily postal distribution to the entire Norwegian populace. Bring is aimed at business customers within mail and logistics in the Nordic area, and consists of specialists who each have key skills within their areas.","_name":"Norway Post"},{"key":"14091","_canTrack":"0","_country":"1409","_url":"http://www.nigerposte.net/","_detail":"Niger Poste is founded in Niger since the colonial period. Niger's accession to the International sovereignty August 3, 1960 led to the creation of the Office of Post and Telecommunications (OPT) by Law No. 70-78 of 27 August 1970. This status is maintained until 1996 to separate the activities of telecommunications, postal activities (following retreats held in August and September 1992) by Ordinance No. 96-28 of 6 June 1996 on the establishment of a public institution of national industrial and commercial office known as the Post Office and Savings (ONPE).  Then in 2006 ONPE changed its status to become a Mixed Economy Company called Niger position. The 2005-21 Act of 28 June 2005 authorizing the conversion of the mixed economy in ONPE Company offered the organization a greater management autonomy in the exercise of its mission and dedicated the opening of capital to the private sector . However, to date only one staff position endorsed the Niger capital previously held by the State of Niger to 100%.","_name":"Niger Post"},{"key":"14101","_canTrack":"1","_country":"1410","_url":"http://www.nipost.gov.ng/","_detail":"The Nigeria Postal service Department came into being with the establishment of the Nigeria Telecommunications Limited (NITEL) on January 1, 1985. NITEL emerged from the merger of the Telecommunications arm of the defunct Post and Telecommunications Department of the Ministry of Communications with the former Nigeria External Telecommunications Limited (NET). Through the promulgation of decree No. 18 of 1987, NIPOST became an Extra-Ministerial Department.","_name":"Nigerian Post"},{"key":"15011","_canTrack":"1","_country":"1501","_url":"http://www.omanpost.om/","_detail":"With effect from 30th April 1966, Oman's postal service was taken over by Oman government, and the first set of Omani postage stamps was issued depicting the port of Muscat, the great forts, and the national crest. The stamps bore the inscription \"Sultanate of Oman\" was then adopted in accordance with the announcement by His Majesty Sultan Qaboos that the name of the country was to be changed from \"Muscat and Oman\" to the \"Sultanate Of Oman\" (on 9th August 1970). The postal service as it is today officially comprises a number of offices, specialized employees, and various means of transport, controlled by government, semi-government, and private departments, whose object is to receive and deliver postal items, including both letters and parcels.","_name":"Oman Post"},{"key":"16011","_canTrack":"1","_country":"1601","_url":"http://www.pakpost.gov.pk/","_detail":"Pakistan Post Office is one of the oldest government departments in the Sub-Continent. In 1947, it began functioning as the Department of Post & Telegraph. In 1962 it was separated from the Telegraph & Telephone and started working as an independent attached department. Pakistan Post is providing postal services in every nook and corner of the country through a network of around 13,000 post offices. Pakistan Post is providing delivery services to about 20 million households and businesses as community service without any cost considerations. In addition to its traditional role, the Pakistan Post also performs agency functions on behalf of Federal and Provincial governments, which inter-alias include Savings Bank, Postal Life Insurance, Collection of Taxes, Collection of Electricity, Water, Sui Gas and Telephone bills. Pakistan Post is also providing a universal postal service network in harmony with the Universal Postal Union (UPU) strategy to ensure secure and timely delivery of mail, money and material at affordable cost through utilization of people, process and technology and innovative product offerings.","_name":"Pakistan Post"},{"key":"16021","_canTrack":"0","_country":"1602","_url":"http://www.palpost.ps/","_detail":"Palestine Post is the company responsible for postal service in the parts of Palestinian territories controlled by the State of Palestine.","_name":"Palestine Post"},{"key":"16031","_canTrack":"1","_country":"1603","_url":"http://www.correospanama.gob.pa/","_detail":"Correos Panama: The Mission of Post and Telegraph: \"Providing postal services, conventional, electronic and special corporate form, profitable, competitive and fair prices, ensuring quality and closest approach of users through the largest network of care and delivery\". The Vision of Post and Telegraph :\"To be the most comfortable, modern, efficient and economical alternative for all Panamanians who need to use special services or deliver shipments to anywhere in the world.\"","_name":"Correos Panama"},{"key":"16041","_canTrack":"1","_country":"1604","_url":"http://www.postpng.com.pg/","_detail":"Post PNG Limited was created by virtue of the company's Act, otherwise known as the Postal Company's Act of 1996. Prior to the creation of Post PNG, the Postal Service was a division of the former Post & Telecommunication Corporation (PTC) established by the Government in 1982. Post PNG is a government ­ owned and controlled company with its Headquarter in Port Moresby. Its policy-making body is the Board of Director's composed of six members including the Managing Director, who at the same time serves as Chief Executive Officer of the company.","_name":"PNG Post"},{"key":"16051","_canTrack":"1","_country":"1605","_url":"http://www.correoparaguayo.gov.py/","_detail":"The National Post of Paraguay (DINACOPA) was created by Law No. 4016/10. The provision of postal services in the country and abroad including the scope of the Universal Postal Service; other services and products created and offered by DINACOPA created; and the issuance and promotion of postage, aimed at meeting the needs of their customers. The DINACOPA functions are: a) The administration, management, development and operation of postal services the country and abroad, including the scope of the universal postal service; other services and products; those provided for in international treaties signed and ratified; postal services and products created by the DINACOPA, to meet customer needs. b) The delivery of hybrid mail services, financial services, logistics and supply any type of new service creation, related correspondence and other postal communications and more..","_name":"Correo Paraguayo"},{"key":"16054","_canTrack":"1","_country":"1605","_url":"http://www.correoparaguayo.gov.py/","_detail":"The National Post of Paraguay (DINACOPA) was created by Law No. 4016/10. The provision of postal services in the country and abroad including the scope of the Universal Postal Service; other services and products created and offered by DINACOPA created; and the issuance and promotion of postage, aimed at meeting the needs of their customers. The DINACOPA functions are: a) The administration, management, development and operation of postal services the country and abroad, including the scope of the universal postal service; other services and products; those provided for in international treaties signed and ratified; postal services and products created by the DINACOPA, to meet customer needs. b) The delivery of hybrid mail services, financial services, logistics and supply any type of new service creation, related correspondence and other postal communications and more..","_name":"Correo Paraguayo (Surface)"},{"key":"16061","_canTrack":"1","_country":"1606","_url":"http://www.serpost.com.pe/","_detail":"Postal Services of Peru SA - SERPOST SA is a corporation organized under private law according to the Law on State Enterprise Activity and the Corporations Act, whose principal activity is the provision of postal services in all modalities scope nationally and internationally. Legislative Decree No. 685 gives SERPOST SA granting the postal service, non-exclusive, forcing provide service throughout the country, in the postal administration of the State to comply with the international agreements and conventions. Our mission: \"Ensuring our customers a timely and quality postal service, strengthen social integration and contribute to national development.\" And our Vision: \"Being recognized as the leader in the postal service of Peru and Latin America.\"","_name":"Serpost"},{"key":"16071","_canTrack":"1","_country":"1607","_url":"http://www.phlpost.gov.ph/","_detail":"The Philippine postal system has a history spanning over 250 years.  The Manila Central Post Office Building, the center of the Philippine postal services and the headquarters of then-Bureau of Posts, was completed in 1926. It was destroyed during World War II (1945) but was rebuilt in 1946, after the war. With the overhaul of the Philippine bureaucracy in 1987, the Bureau of Post was renamed the Postal Service Office (PSO) by the virtue of Executive Order No. 125 issued by then-President Corazon Aquino on April 13, 1987. It was also that order which placed PSO under the Department of Transportation and Communications (DOTC). On April 2, 1992, by virtue of the Republic Act No.7354 issued by then-President Fidel V. Ramos, PSO became a government owned and controlled corporation named as the Philippine Postal Corporation of more commonly known today as PHLPost.","_name":"Philippine Post"},{"key":"16081","_canTrack":"1","_country":"1608","_url":"http://www.poczta-polska.pl/","_detail":"Polish Post is a company with 455 years of tradition, the largest operator on the domestic market - our network includes more than 7,500 outlets, branches and agencies of postal services to individual and business clients.  Aware of the responsibility that rests on us as one of the largest national employers conduct CSR activities and is constantly developing, increasing the efficiency of our entire group. Our focus is on strengthening the most prospective areas - parcels, financial services, insurance and logistics, while expanding the offer digital services. Mail Poland operates across the globe, providing daily dispatches even the remotest corners of the world. Letters, parcels, courier - Polish Post arrive on time, exactly where were addressed. For your convenience, each such service has a number of additional solutions that facilitate the planning of shipping and delivery, such as additional insurance or optional online monitoring their status.","_name":"Poland Post"},{"key":"16101","_canTrack":"1","_country":"1610","_url":"http://www.ctt.pt/","_detail":"CTT Brand supported by a strong reliable image and an reprehensible sense of social responsibility, CTT Group gave its corporate mission – to ensure the connections among citizens, the Public Administration, the companies and organisations in general – a new dimension. CTT Group wishes to enhance the structural values of the brand with new values, by developing innovation and environmental sustainability. Thus, CTT takes a step forward in its positioning showing responsibility towards the environment and keeping satisfying its customers. Aware of its core activity, CTT invests in solutions with less environmental impact through new products and services that show new ways of communicating and respect the environment. Because of its long experience, the good service it provides to the population and its closeness to the citizens, CTT enjoy a reliable image recognized with several honours.","_name":"CTT"},{"key":"16141","_canTrack":"0","_country":"1614","_url":"http://www.palaupost.org/","_detail":"The Republic of Palau Postal Service is thrilled to welcome you to our newest website. The Palau's Post Office is situated in downtown of Koror State of the Republic of Palau. Geographically speaking the Republic of Palau is an island nation that can be located on the map, between the Republic of Philippines and the US Territory of Guam.","_name":"Palau Post"},{"key":"17011","_canTrack":"1","_country":"1701","_url":"http://www.qpost.com.qa/","_detail":"The GPC is a member of the Universal Postal Union (UPU), the Arab Postal Committee (APC) and the GCC Postal Committee. Qatar hosted the first conference to inaugurate the Gulf Postal Organization in April 1977 which later changed its name to the GCC Postal Committee. The Post Office in Qatar began operating modestly in 1950 with just 6 staff. Nevertheless the story begins in earnest in May 1963 when the State of Qatar took full responsibility for its own Postal Services. The world is changing faster than ever before and Postal Administrations are not immune to these changes; the postal future is thus quite daunting. However, in October 2001, specifically with the future in mind the GPC became an independent corporation. This important change is designed to enable the corporation to compete internationally, to meet its customer's needs and to provide a platform for the future service reliability of the business and to benefit the citizen's of Qatar.","_name":"Q-Post"},{"key":"18021","_canTrack":"1","_country":"1802","_url":"http://www.posta-romana.ro/","_detail":"The Romanian Post is the national postal operator in the field of postal offices and is owned by the Romanian state, represented by the Ministry of Communications and Information Technology (75% of the shares) and the Property Fund (25% of the shares). The Romanian Post is the national operator in the field of postal services, sole supplier of universal service in any point on the Romanian territory, providing prices accessible to all the users thereof and at high quality standards. The Romanian Post operates in the field of postal communication, the main objects of activity thereof being the management, development, operation of postal services and the collaboration with similar foreign organizations in the provision of these services internationally, in compliance with the provisions of the Ordinance no. 31/2002 approved by the Law no. 642/2002 regarding the postal services and the licences or authorisations granted.","_name":"Romania Post"},{"key":"18031","_canTrack":"1","_country":"1803","_url":"https://pochta.ru/","_detail":"The FSUE Russian Post - is the national postal operator, member of the Universal Postal Union. In 2013 the company was put on the list of strategic enterprises of the Russian Federation. Russian Post includes 86 regional branches, 42000 post offices and nearly 350 000 employees, 87% of which are women. The company provides its services on the territory of 17 000 000 square kilometers. Russian Post operates in 9 time zones, delivering postal items by 2 600 000 road, 1200 air and 106 railway routes. The company functions under the supervision of the Ministry of Telecom and Mass Communications of the Russian Federation. The Main office of the company is located in Moscow.","_name":"Russia Post"},{"key":"18041","_canTrack":"1","_country":"1804","_url":"http://www.i-posita.rw/","_detail":"When National Independence was declared on 1st July 1962, the former Ministry of Posts and Telecommunications was reattached to the Ministry of Public Works and Mechanization to form one Ministry designated as the Ministry of Public Works and Equipment on 6th February 1963. This Ministry counted, among its attributions, \"the management of the Postal Operations\". The National Post Office (Iposita) is pleased to welcome you and to offer you a variety of services with the aim of meeting your expectations. Iposita is a one stop shop for many services. Meaning that one visit to the post office allows you to send mail, perform banking activities through Postal Checking Accounts Service (CCP), buy airtime, buy electricity, send or receive a parcel and exchange money, and many other services.","_name":"Rwanda Post"},{"key":"19021","_canTrack":"1","_country":"1902","_url":"http://www.svgpost.gov.vc/","_detail":"SVG Postal Corporation was established by an Act of Parliament, No. 17 of 2003 and came into being on 1st October, 2003. SVG Post replaced the General Post Office as the official Postal Administration of the state and effectively commenced operations on 16th October, 2003 with the transfer of the General Post Office from its temporary location at Paul's Avenue to the newly renovated offices on the Ground Floor of the Ministerial Building on Halifax Street, Kingstown. Our mission: We deliver first class customer satisfaction by providing high quality postal and related services in a reliable, secured manner through well trained motivated staff. And our vision: To be the leading Postal Service providing reliable, high quality, competitive postal and related solutions innovatively designed to deliver customer satisfaction.","_name":"SVG Post"},{"key":"19031","_canTrack":"1","_country":"1903","_url":"http://www.correos.gob.sv/","_detail":"General of Posts of El Salvador, Lic. Postal has become a self-sustainable, agile, competitive and efficient, able to successfully address new customer expectations in the postal field permanently and with appropriate quality standards organization.  Our mission: We are a dynamic institution offering postal services of the highest quality, with national and international coverage at the best market price level, taking customer as our top priority, providing better security and competitive lead times. And our vision: To be the number one correspondence in El Salvador, providing the best customer service, our main asset being a highly effective and satisfied staff through continuous improvement in all processes and in Human Capital.","_name":"Correo El Salvador"},{"key":"19051","_canTrack":"1","_country":"1905","_url":"http://www.poste.sm/","_detail":"The origins of the Republic's postal history are as far off as they are illustrious. It all began with a measure adopted by the Prince and Sovereign Council on the 7th of October 1607, which nominated a Postman whose duty was to go to Rimini to pick up incoming mail and leave any to be forwarded, in order to guarantee the population of San Marino contact with the outside world. San Marino was therefore the first state in the world to dream up and launch a public postal service with no aim of creating income for the coffers of the State. And so it was that in the winter of 1607-1608 the first Postman, a certain Giulio Franchini, began his yo- yoing between Pianello (the Piazza in front of the Palazzo Pubblico) and Rimini post station; initially once a week then twice and even more often, always on foot and in any weather!","_name":"San Marino Post"},{"key":"19061","_canTrack":"0","_country":"1906","_url":"","_detail":"","_name":"Postal"},{"key":"19071","_canTrack":"1","_country":"1907","_url":"http://www.sp.com.sa/","_detail":"Saudi Postal Corporation bases its work on modern strategies and advanced postal services, to keep pace with developments in the postal market and the postal industry. The foundation of this is finding new concepts for this vital sector, to build a strong and continuous relationship between citizens, the post and the modern courier. Saudi Postal Corporation is currently working on providing postal services in accordance with global standards, through the unending ideas of its sons, and their enthusiastic ambition and their dedication to their blessed work. Their aim to serve this institution and its customers, based on a philosophy of development driven by its underlying human element, which is the main element in the entire postal process and the element seen first by public clients.","_name":"Saudi Post"},{"key":"19081","_canTrack":"1","_country":"1908","_url":"http://www.laposte.sn/","_detail":"The postal service in Senegal consists of players that are: The Ministry of Posts, Telecommunications and ICT, The public incumbent, SN Post, consumers.The Department's mission is:monitoring and coordination of sectoral policies. Established by the head of state in the postal service.The development of legislation and regulations Representation of the state to the International Organizations The Government, through the Ministry, taking note of these developments, decided to adapt the legislative framework and legally open to competition certain market segments today de facto liberalized. In the future, depending on developments in the sector, further opening to competition will be gradually implemented.","_name":"La Poste De Senegal"},{"key":"19091","_canTrack":"1","_country":"1909","_url":"http://www.posta.rs/","_detail":"PE Post of Serbia was founded in 1990. pursuant to Law on communications as a company in charge of PE Post of Serbia services, with state-owned instruments of labor. In May 1997, pursuant to amandments to the Law on communication systems, our company was organized as a holding – a group of companies comprising PE Post of Serbia and its spin-off subsidiaries. PE Post of Serbia is a mother company within the holding system. The same year, PE Post of Serbia founded a subsidiary for telecommunications services –Company for telecommunications \"Telekom Srbija\" A.D. PE Post of Serbia is one of the founders and shareholders, i.e. stakehoders in: Company for telecommunications \"Telekom Srbija\" A.D., Postal Savings Bank a.d. a, and in cooperation with them defines its basic business mission primarily concerning improvement of quality of services offered to end users. Share capital of PE Post of Serbia in its subsidiaries.","_name":"Serbia Post"},{"key":"19111","_canTrack":"1","_country":"1911","_url":"http://www.seychellespost.gov.sc/","_detail":"Seychelles is a member of the Universal Postal Union and a signatory to the Universal Postal Services where basic postal services such as accessibility, affordability are important. The first post office was opened in 1861 though in 1824 a letter is said to have been \"privately carried\" to Europe. The Post Office became autonomous from Mauritius in August 1982. It was in 1893 that the first local post office was introduced in Seychelles. The new Postal Act is a modern Act and replace the Postal Act of 1803. Globally, over the past 10 to 15 years the Postal service all over the world has been undergoing major reform. Our vision and mission: To be one amongst the leading operators in the provision of postal services and products in the region.To provide every household, business entity in Seychelles with the ability to communicate and conduct business with each other and the rest of the World through prompt, reliable, affordable, secure postal services and other value added postal products.","_name":"Seychelles Post"},{"key":"19121","_canTrack":"0","_country":"1912","_url":"http://www.salpost.sl/","_detail":"The history of the Sierra Leone Postal Service started as far back as 1841 during the period of Jerome who established a village Post Office. On the 14th February 1990 The Post Office became a solely owned Government Parastatal, The Sierra Leone Postal Services (Limited), enjoying a corporate status as a Limited Liability Company under Cap 249 of the laws of Sierra Leone. The Sierra Leone Postal Services is a member of the Universal Postal Union, the Umbrella union of the postal services world wide. This union was founded in 1874 in Berne Switzerland and establishing a collective convention governing the International Postal Services. It is a specialized agency of the United Nations Development Programme (UNDP).SALPOST is also a member of the PANAFRICAN POSTAL UNION (PAPU) which links all African Postal Services together.","_name":"Sierra Leone Post"},{"key":"19131","_canTrack":"1","_country":"1913","_url":"http://www.singpost.com/","_detail":"SingPost was listed on the Main Board of the SGX-ST on 13 May 2003. The company has won many awards and accolades. It is the only postal company in the world to have won the Express Mail Service (EMS) Cooperative Certification Gold Level Award by the Universal Postal Union for its Speedpost Worldwide Courier Service for 11 consecutive years since 2001. It was also named runners-up in the \"Most Transparent Company Award 2011\" for the sixth consecutive year in the SIAS Investors' Choice Awards. SingPost is the designated Public Postal Licensee (PPL) for Singapore, providing comprehensive services for collecting, sorting and distributing domestic and international mail, including Direct Mail and Mailroom Management services. As the leading provider of delivery solutions domestically as well as being the local worldwide delivery service provider with our courier brand, Speedpost, SingPost provides a wide suite of delivery solutions to suit the needs of our corporate and retail customers.","_name":"Singapore Post"},{"key":"19133","_canTrack":"1","_country":"1913","_url":"http://www.speedpost.com.sg/","_detail":"Speedpost offers door-to-door deliveries with complete reliability and efficiency both within Singapore and to more than 220 countries and territories worldwide. We have also steadily expanded our logistics business beyond Singapore through our wholly owned subsidiary, Quantium Solutions. Additionally, we also offer integrated, customised logistics solutions that cover a wide range of value-added services including warehousing, fulfilment, distribution and inventory management. SingPost owns one of the largest retail distribution networks in Singapore.  Our extensive multi-channel network of over 60 post offices, more than 300 SAM and SAMPLUS as well as vPOST our internet portal, provides one-stop, round-the-clock convenience for customers for a wide variety of postal, bill payment, ticketing, government application and payment as well as financial services. We also offer a host of higher-value consumer products and services to meet our customers' fast-changing needs.","_name":"Speedpost"},{"key":"19141","_canTrack":"1","_country":"1914","_url":"http://www.posta.sk/","_detail":"Slovenská pošta, a. s., is a leading provider of modern communication, distribution and payment services on the domestic market, with created logistics conditions to do business in the Central and Eastern Europe. It is a reliable intermediary satisfying changing customer needs and it also offers new value-added and high-quality products and complex solutions. Since March 1, 1996, Slovenská pošta has had its headquarters in Banská Bystrica. Slovenská pošta has been financially independent since it was established, i.e. it does not receive any subsidies from the State budget. Slovenská pošta offers its services throughout a network of more than 1 500 post offices. Its business strategy is to reach a full competitiveness and a financial self-sufficiency.","_name":"Slovakia Post"},{"key":"19151","_canTrack":"1","_country":"1915","_url":"http://www.posta.si/","_detail":"Pošta Slovenije is 100 percent state-owned company successfully operating in various markets where it generates most of its revenues. The company has a clear business policy with identifiable values and corporate culture focusing on satisfied customers. We are fully aware of our responsibility towards our employees, our individual and business customers, as well as towards the wider social environment. With this in mind, we continuously enhance the range and quality of our services, tailoring them to the specific needs of our customers and increase our responsiveness through the provision of selected services in cooperation with our international partners. We are one of Slovenia's major logistics service providers, proud of our history and keenly aware of the key role of our more than 6,700 employees. We develop technological excellence, award enterprise, strengthen commitment, strive towards development and generate profit. We connect Slovenia and reach out to the world, delivering anything anywhere swiftly, reliably and with a high-quality service.","_name":"Slovenia Post"},{"key":"19161","_canTrack":"1","_country":"1916","_url":"http://www.solomonpost.com.sb/","_detail":"The Solomon Islands Postal Corporation was established by ACT of Parliament through powers vested to the Corporation by the Solomon Islands Postal Corporation Act 1996. The functions of the Corporation shall be to: Provide Postal Services within Solomon Islands and other countries, to carry on any business or activity relating to Postal Services, and to carry on business or activity which is incidental to postal services. The Corporation is governed by the Board of Directors upon which the Executive is reporting to. The Chief Executive Officer has two Deputies representing the two major divisions. The two Deputies must ensure daily operation of both divisions are achieved and reported to the executive.","_name":"Solomon Post"},{"key":"19171","_canTrack":"1","_country":"1917","_url":"http://www.postoffice.co.za/","_detail":"A world first for the Post Office, as South African President Thabo Mbeki electronically signs the Electronic Communication and Transaction Act into law. This was the first Act in the world to be signed into law by an electronic signature. The signing was enabled using the Post Office authentication service. The Act defines the Post Office as the \"preferred authentication service provider\" of identification procedures necessary for the issuing of advanced electronic signatures. VisionTo be recognised among the leading providers of postal and related services in the world.MissionEnabling South Africans to connect with the world by distributing information, goods, financial and government services; leveraging our broad reach and embracing change, technology and innovation.","_name":"South Africa Post"},{"key":"19181","_canTrack":"1","_country":"1918","_url":"http://www.correos.es/","_detail":"The Post Group is formed by the union of four companies, with the aim of strengthening our trade policy in the postal market and that of paquetería. De Thus, we appear to the market and society differently, as a real operator global communication solutions, presenting the most comprehensive offering of Correos Group CorreosEn mercado. Logotipo of work over 57,000 people dedicated to distributing over 4,000 million shipments a year we manage; to the tasks of processing, transport and express delivery; or commercialize the great diversity of services in the wide network of offices or through our online services. But above all, we are a company of people serving people working for Post Office every day is a more modern, efficient and competitive company that offers the best communication solutions to all citizens.","_name":"Correos Spain"},{"key":"19191","_canTrack":"0","_country":"1919","_url":"http://www.slpost.gov.lk/","_detail":"Sri Lanka Post was established by the Dutch ruler's way back in 1798 in the Maritime Provinces of the country with five offices. Today it has grown in to a mammoth organisation with more than 19,000 employees. Sri Lanka Post serves a population of nearly 20 million inhabitants in Sri Lanka. During the existence of Sri Lanka Post though known by various names it continued to serve the populace with dedication. In the year 2,004 we had a Post Office for every 2, 400 people of this country. This in real terms means that there was an office for every 14 km radius. Today majority of our offices are equipped with state of the art equipment to provide an efficient service to our customers. Through the 4,712 offices we provide a variety of services.","_name":"Sri Lanka Post"},{"key":"19201","_canTrack":"1","_country":"1920","_url":"http://sudapost.sd/","_detail":"The first post offices to be opened in Sudan were in 1867 at Suakin and Wadi Halfa; in 1873 at Dongola, Berber and Khartoum; and in 1877 at Sennar, Karkouk, Fazoglu, Elkedaref, El Obeid, Al-Fasher and Fashoda (now Kodok).  The Mahdist revolt, which began in 1881, resulted in all Egyptian post offices being closed by 1884. It culminated in the fall of Khartoum and the death of the British governor General Gordon (Gordon of Khartoum) in 1885. The Egyptians and British withdrew their forces from Sudan and the country was left with no postal service until the reconquest of Sudan began in 1896. When the campaign started in March 1896, postal service was made available to the troops but no stamps were used.","_name":"Sudan Post"},{"key":"19211","_canTrack":"0","_country":"1921","_url":"http://www.surpost.com/","_detail":"At the end of the 18th century, the first post office in Suriname was established by the British. It remained in operation until 1815 In that year, Suriname was at the Treaty of Paris, a Dutch colony. By the Act of April 4, 1993, the Surinamese Post Office 'Surpost' by default. Surpost was established as a legal entity \"Sui Generis\" since this legal form provides for the exercise of government influence on the public utility functions of the postal service. That Surpost partly succeeded in this, has been noticeably when the Business Unit cargo in March 2010 was chosen by the Surinamese community 'Best Service 2010 For this she received the award from 2009 to 2010 in the category of Customer Service Providers.","_name":"Surpost"},{"key":"19231","_canTrack":"0","_country":"1923","_url":"http://www.sptc.co.sz/","_detail":"SwaziPost is the country's prime mover of written communications and parcels with services comprising ordinary and registered mail, a courier and freight moving. The Post Office provides the most cost-effective delivery option. SwaziPost is a delivery agent for Government, paying out social grants, and is a retail outlet for MTN, Swaziland Electricity Company, SwaziTelecom, Swaziland Royal Insurance Corporation and Swaziland Water Services Corporation. Cellphone and landline airtime, money transfer services, stationery, and philatelic products are also available, while Internet cafes and computer accessories are provided throughout Swaziland. With 33 major outlets and 69 agencies, SwaziPost serves remote and rural parts of the country and has introduced mail room management and post direct, as well as banking and hybrid mail services through a computerisation project. All postal transactions are now computerised, improving efficiency and enhancing service delivery.","_name":"Swaziland Post"},{"key":"19241","_canTrack":"1","_country":"1924","_url":"http://www.postnord.se/","_detail":"Posten AB is a part of PostNord AB that was founded through the merger of Post Danmark A/S and Posten AB in 2009. The group offers communication and logistics solutions to, from and within the Nordic region. In 2011, the group had net sales of over SEK 39 billion. The group has over 40,000 employees. The parent company PostNord AB is a Swedish public company owned 40% by the Danish state and 60% by the Swedish state. Votes are allocated 50/50 between the owners. Operations are managed in business area Breve Danmark (mail), business area Meddelande Sverige (mail), business area Logistics and Strålfors. The group's headquarter is located in Solna, Sweden.","_name":"PostNord Sweden"},{"key":"19244","_canTrack":"1","_country":"1924","_url":"http://www.directlink.com/","_detail":"Direct Link's history is rooted in our customers' success. Since 1986, we have been creating winning logistical solutions for international companies and e-tailers. Through customization and tailoring, we help our customers with everything from taking the leap into a new market to building a sustainable logistical chain. Or sometimes, just figuring out the best way to send a business letter.","_name":"Direct Link"},{"key":"19245","_canTrack":"0","_country":"1924","_url":"http://www.postnord.com/","_detail":"Posten AB is a part of PostNord AB that was founded through the merger of Post Danmark A/S and Posten AB in 2009. The group offers communication and logistics solutions to, from and within the Nordic region. In 2011, the group had net sales of over SEK 39 billion. The group has over 40,000 employees. The parent company PostNord AB is a Swedish public company owned 40% by the Danish state and 60% by the Swedish state. Votes are allocated 50/50 between the owners. Operations are managed in business area Breve Danmark (mail), business area Meddelande Sverige (mail), business area Logistics and Strålfors. The group's headquarter is located in Solna, Sweden.","_name":"PostNord"},{"key":"19251","_canTrack":"1","_country":"1925","_url":"http://www.swisspost.ch/","_detail":"The structures of Swiss Post Ltd are geared to the market. The Board of Directors is the most senior executive body at Swiss Post. It is responsible for implementing the strategic objectives set by the Federal Council and for ensuring provision of the universal service. Executive Management is responsible for operational management. Swiss Post operates according to clear principles: It pursues a vision which focuses on solid core values. The strategy and strategic thrusts are derived from this vision.","_name":"Swiss Post"},{"key":"19261","_canTrack":"1","_country":"1926","_url":"http://www.syrianpost.gov.sy/","_detail":"General Postal Corporation under the Regulatory Decree No. / 1936 / dated 10/7/1975 and contributed effectively in the economic and social development and scientific in diameter through Matadi from an ancient and necessary services to the community. Today, in a period characterized by a rapid pace of globalization and deregulation and the emergence of modern technologies, particularly in the world of communications and the application of quality systems and rely on the principles of marketing and competition, the outcome of the General Postal Corporation itself to meet the challenges of stage and seek to keep pace with development taking into account the continuing provide basic postal services totalitarian good specifications and the most convenient and cost less. To achieve these ends, the General Postal Corporation has introduced several new services and constantly strive to provide more of these services to meet the requirements of the public service recipients.","_name":"Syrian Post"},{"key":"19271","_canTrack":"0","_country":"1927","_url":"http://www.post.gov.kn/","_detail":"Little is known concerning the early Postal Affairs of St. Christopher & Nevis but it is recorded that the British General Post Office was to establish a branch office on the Island of Nevis under an Act of Parliament passed in 1710, although arrangements may not have been finalized for a number of years afterwards.  Nevis appears as a \"New Office\" in the Post Office Account of 1787.  The first recorded postal markings for St Christopher dates from 1746, although it is probable that a branch of British General Post Office operated on the island before that date.  Control of Postal Services was passed to local authorities around 1858. Today the Post Office functions as a Government Department under the Ministry of Youth Empowerment, Sports, Information Technology, Telecommunications and Post.  The postal network in St Christopher and Nevis comprises of six (6) postal outlets located in different parts of the country with a workforce of 92 employees.","_name":"St. Kitts & Nevis Post"},{"key":"19281","_canTrack":"1","_country":"1928","_url":"http://samoapost.ws/","_detail":"Samoa Post Company can send your mail items domestically and internationally. A comprehensive guide to sending your letters with Samoa Post, including standard delivery and Domestic Courier services are being provided for you to make a choice of what services that best suits your mailing requirements, provided within a world standard environment.","_name":"Samoa Post"},{"key":"19291","_canTrack":"0","_country":"1929","_url":"http://mipt.gov.so/","_detail":"The Somali Postal Service (Somali Post) is the national postal service of Somalia. It is part of the Federal Government of Somalia's Ministry of Information, Posts and Telecommunications. The postal authority historically sent mail to and received parcels from various domestic and international destinations, but shut down operations in 1991.  Somali Post later officially relaunched on 1 November 2013,  following a Memorandum of Understanding signed with Emirates Post in April of the year. In December 2012, the Minister of Information, Posts and Telecommunications, Abdullahi Elmoge Hersi, announced that Somalia's new federal government planned to officially relaunch the Somali Postal Service in 2013. On 1 November 2013, international postal services for Somalia officially resumed. The UPU is now assisting the Somali Postal Service to develop its capacity, including providing technical assistance and basic mail processing equipment.","_name":"Somali Post"},{"key":"19301","_canTrack":"0","_country":"1930","_url":"","_detail":"","_name":"Postal"},{"key":"19321","_canTrack":"0","_country":"1932","_url":"","_detail":"","_name":"Postal"},{"key":"20011","_canTrack":"1","_country":"2001","_url":"https://ipost.post.gov.tw/","_detail":"Chunghwa Post Co., Ltd., hereinafter called the Company,is established under the provisions of Article 3 of the Postal Act by the Ministry of Transportation and Communications (MOTC). Its establishment shall be based on the provisions of this act hereof. Where matters are not covered under this act, all other laws shall govern. The Company may engage in the business of mail delivery, savings, remittances,simple life insurance, philately and related merchandise as well as management of postal assets. Subject to approval by the MOTC, the Company may also operate as an agent for other businesses, and make investments or operate related businesses.","_name":"Chunghwa Post (Registered)"},{"key":"20012","_canTrack":"1","_country":"2001","_url":"https://ipost.post.gov.tw/","_detail":"Chunghwa Post Co., Ltd., hereinafter called the Company,is established under the provisions of Article 3 of the Postal Act by the Ministry of Transportation and Communications (MOTC). Its establishment shall be based on the provisions of this act hereof. Where matters are not covered under this act, all other laws shall govern. The Company may engage in the business of mail delivery, savings, remittances,simple life insurance, philately and related merchandise as well as management of postal assets. Subject to approval by the MOTC, the Company may also operate as an agent for other businesses, and make investments or operate related businesses.","_name":"Chunghwa Post (Parcel)"},{"key":"20013","_canTrack":"1","_country":"2001","_url":"https://ipost.post.gov.tw/","_detail":"Chunghwa Post Co., Ltd., hereinafter called the Company,is established under the provisions of Article 3 of the Postal Act by the Ministry of Transportation and Communications (MOTC). Its establishment shall be based on the provisions of this act hereof. Where matters are not covered under this act, all other laws shall govern. The Company may engage in the business of mail delivery, savings, remittances,simple life insurance, philately and related merchandise as well as management of postal assets. Subject to approval by the MOTC, the Company may also operate as an agent for other businesses, and make investments or operate related businesses.","_name":"Chunghwa Post (EMS)"},{"key":"20021","_canTrack":"0","_country":"2002","_url":"","_detail":"","_name":"Postal"},{"key":"20031","_canTrack":"1","_country":"2003","_url":"http://www.posta.co.tz/","_detail":"Tanzania Posts Corporation (TPC) was established in 1994 to provide a national postal service within the republic, and a link between Tanzania and the world. TPC offers mails and courier services, financial services, agency services, secretarial services, logistics services and Internet café services. It is a one-stop shopping venue.","_name":"Tanzania Post"},{"key":"20041","_canTrack":"1","_country":"2004","_url":"http://www.thailandpost.co.th/","_detail":"The Communications Authority of Thailand (CAT) was established on 25th February 1977 as a state-owned enterprise in accordance with the Communications Authority of Thailand Act 1976. Since her establishment, all aspects of postal operations including service provisions previously undertaken by the Post and Telegraph Department were transferred to the CAT and she has been responsible for the development of the postal service ever since. During the early days, the office of the CAT was at the Central Post Office and was later moved to Chaeng Watthana Road. The CAT had developed postal infrastructure and her operating system constantly and become one the leading state-owned enterprise in the Kingdom, renowned for her capability and service quality that had continually been kept up to the international standards.","_name":"Thailand Post"},{"key":"20051","_canTrack":"1","_country":"2005","_url":"http://www.laposte.tg/","_detail":"The Post Corporation of Togo made the automation of operations on the heart of its development strategy. That's why she opted for early information and discussion on the canvas platform. The website (www.laposte.tg) launched the first version in 2000 just renové. Tout strengthening current gains, the Post now wants to build a relationship of trust and close around traditional values ​​of conviviality and sharing. More than ever, it remains responsive to the demands of customers and ready to do more.  We are aware of the many challenges. Many things remain to improve to better meet your expectations. But we are determined to do this through your criticisms and suggestions. Our unique ambition is to simplify your life and especially to ensure to all of our citizens with quality services available anywhere.","_name":"La Poste De Togo"},{"key":"20061","_canTrack":"1","_country":"2006","_url":"http://www.tongapost.to/","_detail":"Tonga Post Limited was formed in 2008 as a public enterprise. It's shareholder is the Government of Tonga. It's Board of Directors is responsible to the shareholding Minister for the enterprise's performance. As the designated postal operator for the country, it is a member of the Universal Postal Union (UPU), and the Asia and Pacific Postal Union (APPU). It is estimated that the volume of business is 90% international mail and 10% domestic mail. The major postal partners that exchange most mail items with are United States Postal Services, Australia Post, New Zealand Post and Post Fiji. The delivery standards are subject to changes in international flights.","_name":"Tonga Post"},{"key":"20071","_canTrack":"0","_country":"2007","_url":"http://www.ttpost.net/","_detail":"The Trinidad and Tobago Postal Corporation (TTPost) demonstrates our commitment to deliver quality service to you. Your comments and observations are always welcome and we strongly encourage you to tell us what we can do to improve our service. Our Vision: \"To be a world leader in the provision of postal and consumer services, while achieving economic viability and sustainability\". Mission: \"To provide innovative, competitive, quality postal services and solutions for business and consumers. We do this through knowledgeable, customer-focused employees and effective systems\".","_name":"TT Post"},{"key":"20091","_canTrack":"0","_country":"2009","_url":"","_detail":"","_name":"Postal"},{"key":"20101","_canTrack":"1","_country":"2010","_url":"http://www.poste.tn/","_detail":"The Tunisian Post is the company responsible for postal service in Tunisia. It also operates banking services within Tunisia as well. The company was founded in 1847, and was admitted to the Universal Post Union in 1878. The Tunisian Post opened the Caisse d'Épargne Nationale Tunisienne (Tunisian National Savings Bank) in 1956.","_name":"La Poste De Tunisia"},{"key":"20111","_canTrack":"1","_country":"2011","_url":"http://www.ptt.gov.tr/","_detail":"General Directorate of PTT, which became a State Economic Enterprise (SEE) in 1954, has been transferred into the status of the State Economic Establishment (SEE) by the Decree Law No. 233 on Reorganization of the State Enterprises in 1984. By the Law dated 18.06.1994 and No. 4000,  the General Directorate of PTT was restructured and divided into two as, the General Directorate of Posts and Turk Telecom Coop. , and the General Directorate of Posts  started to give service  independently since 24.04.1995. The name of Our Administration which had been \"The General Directorate of Posts\" was amended as \"The General Directorate of  Post and Telegraph Organization  (PTT) \" under the Article 24 of the Law No.4502, which  entered into force by being published in the Official Newspaper numbered 23948, dated 29.01.2000.","_name":"PTT"},{"key":"20121","_canTrack":"0","_country":"2012","_url":"http://www.turkmenpost.gov.tm/","_detail":"Turkmen Post (Russian: Туркменпочта, Turkmenpochta), is the national postal operator of Turkmenistan. The company is responsible for the delivery of mail and issuing postage stamps. It has been a member of the Universal Postal Union since January 26, 1993. Its headquarters are located in Ashkabad. Mail service has existed in Turkmenistan since the time of the Russian Empire. However, since October 1991, the country organizes its own postal service functions.","_name":"Turkmen Post"},{"key":"21011","_canTrack":"1","_country":"2101","_url":"http://www.ugapost.co.ug/","_detail":"Welcome to the new face of Uganda Post Limited, trading as Posta Uganda. Posta Uganda is the most extensive provider of postal services in Uganda, having an extensive network of postal delivery outlets down to sub-country level. Mail is delivered to over 70,000 post boxes all over the country, and through our 300 post offices we offer a host of auxiliary services. These include letter and parcel conveyance, an express courier service, local and international money transfers, internet services, philately for collectors, affordable public transport by the Post Bus, distribution of newspapers, magazines as well as being an agent for telecommunications providers.","_name":"Uganda Post"},{"key":"21021","_canTrack":"1","_country":"2102","_url":"http://ukrposhta.ua/","_detail":"Ukrainian State Enterprise of Posts \"Ukrposhta\" (USEP \"Ukrposhta\") are managed by the Ministry of Infrastructure of Ukraine, is the national postal operator Ukraine under the Cabinet of Ministers of Ukraine dated 10 January 2002. Ukrposhta operates as an independent economic unit since 1994, when it was formed Ukrainian Union Posts \"Ukrposhta\", which in July 1998 was reorganized into the current re USEP \"Ukrposhta\" under the Restructuring Program Ukrposhta of the Cabinet of Ministers of Ukraine 04.01.98 at number 1. Ukrposhta today is more than 12,500post offices throughout the country, of which over 10 thousand, More than 91 000 employees, Direct fetching to 15 million subscriber mailboxes.","_name":"Ukrposhta"},{"key":"21023","_canTrack":"1","_country":"2102","_url":"http://dpsz.ua/","_detail":"The Special Post Service of Ukraine was established on the 1st August 1939, following a Decision of the USSR Council of People's Commissars. It was aimed to provide reliable delivery of confidential correspondence.  At the beginning of the War, the Special Post Service was evacuating significant documents to rearward areas of the country and providing delivery of correspondence to the military units and government agencies. State Enterprise of Special Post participates in providing Special Post services for the most significant events of the country such as elections, nationwide referendums, general secondary education tests, etc. For more than 70 years, the staff of the Special Post was gaining invaluable expertise of cooperation with various customers. It enabled the Enterprise to take an important place at the postal services market.","_name":"Ukraine EMS"},{"key":"21031","_canTrack":"1","_country":"2103","_url":"http://www.pochta.uz/","_detail":"The postal service of Uzbekistan is an expanded postal net with postal routes, which is used to receive, handle and deliver postal items, state pensions and periodicals. The country national postal net is organized by Open Joint-Stock Company \"Uzbekiston Pochtasi\" according to the geographical principle. It includes 14 regional divisions, which are structured in 177 country and city centres, 2986 post offices (2296 rural) and 1 specialized branch – \"Halkaro Pochtamt\" also 34 air routes, 2 railway route, 436 automobile routes, providing the regular conveyance of postal items. Open Joint-Stock Company \"Uzbekiston Pochtasi\" is the national post operator of Uzbekistan. It provides the exchange of post office items of different types with all countries of the world and fulfills the republic's commitments to UPU.","_name":"Uzbekistan Post (Registered/Parcel)"},{"key":"21033","_canTrack":"1","_country":"2103","_url":"http://www.pochta.uz/","_detail":"The postal service of Uzbekistan is an expanded postal net with postal routes, which is used to receive, handle and deliver postal items, state pensions and periodicals. The country national postal net is organized by Open Joint-Stock Company \"Uzbekiston Pochtasi\" according to the geographical principle. It includes 14 regional divisions, which are structured in 177 country and city centres, 2986 post offices (2296 rural) and 1 specialized branch – \"Halkaro Pochtamt\" also 34 air routes, 2 railway route, 436 automobile routes, providing the regular conveyance of postal items. Open Joint-Stock Company \"Uzbekiston Pochtasi\" is the national post operator of Uzbekistan. It provides the exchange of post office items of different types with all countries of the world and fulfills the republic's commitments to UPU.","_name":"Uzbekistan Post (EMS)"},{"key":"21041","_canTrack":"1","_country":"2104","_url":"http://www.correo.com.uy/","_detail":"On January 1, 1996, by Art. 747 of Law 16.736, Uruguay Postal has become a state enterprise, creating the National Postal Administration, modifying their former legal status that included him as a dependent unit of a Ministry in the Central Administration and becoming a decentralized service commercial in nature. This new situation has allowed Uruguayan Postal new objectives and strategies are raised have increased the quality of its management. The adoption of new and modern technologies, redesigning its engineering, providing new and better services, the adoption of marketing policies, training of staff in general areas and specific, are some of the elements that allow today Email Uruguayan being the leader of the postal market, closer and closer to the efficiency goal and competing strongly with private emails, provide its services with the same quality at a lower cost, also fulfilling a social purpose.","_name":"Correo Uruguayo"},{"key":"21051","_canTrack":"1","_country":"2105","_url":"http://www.usps.com/","_detail":"The United States Postal Service (originally called the U.S. Post Office Department, when it was completely managed by the U.S. Government before 1971) also known as the Post Office, U.S. Mail, or Postal Service is an independent agency of the United States federal government responsible for providing postal service in the United States. It is one of the few government agencies explicitly authorized by the United States Constitution. The USPS traces its roots to 1775 during the Second Continental Congress, where Benjamin Franklin was appointed the first postmaster general. The cabinet-level Post Office Department was created in 1792 from Franklin's operation and transformed into its current form in 1971 under the Postal Reorganization Act. The USPS employed 626,764 workers (as of January 2014) and operated 211,654 vehicles in 2013. The USPS is the operator of the largest civilian vehicle fleet in the world. The USPS is legally obligated to serve all Americans, regardless of geography, at uniform price and quality. The USPS has exclusive access to letter boxes marked \"U.S. Mail\" and personal letterboxes in the United States.","_name":"USPS"},{"key":"22021","_canTrack":"1","_country":"2202","_url":"http://www.vanuatupost.vu/","_detail":"Vanuatu Post has created an official Post Office with a difference. It is the world's only Underwater Post Office. Situated within the Hideaway Island marine sanctuary, the Post Office sits in around three metres of water and both divers and snorkellers are able to post special \"waterproof postcards\". If snorkellers cannot duck-dive down that far, Hideaway Island staff will be on the spot to help out. Unbelievably Vanuatu Post has established a post box near the fiery rim of Mt.Yasur's crater, where mailing a letter is a hot experience! Imagine molten lava exploding in the air metres from where you are writing and sending your postcard! This is what Volcano Post is all about.","_name":"Vanuatu Post"},{"key":"22031","_canTrack":"0","_country":"2203","_url":"http://www.ipostel.gob.ve/","_detail":"Ipostel summarizes the history of official mail in Venezuela. Body under the Ministry of Popular Power for Telecommunications and Information Technology, its status autonomous institute was granted by law published in the Official Gazette of Venezuela, 28 January 1978 therefore Ipostel up today to 30 years of services. By law, is currently the regulator for granting concessions to allow, to private companies providing public postal service; a condition that will change, due to the eventual adoption of the new Law on Postal Services, approved in first reading (2002), by the National Assembly of the Republic, which delimits the roles of regulator and service provider. Internationally, Ipostel actively participates as a member of the Universal Postal Union UPU and is one of the Administrations Postal Operations Council, CEP / UPU. Ipostel offers the widest coverage of the Venezuelan postal service; more than 300 offices in the most diverse parts of the country and 2197 postmen distributed nationally, to ensure timely delivery at the points where the competition fails.","_name":"Ipostel"},{"key":"22041","_canTrack":"1","_country":"2204","_url":"http://www.vnpost.vn/","_detail":"On 26/12/2007, Postal Corporation Vietnam officially launched based on established decision No. 16/2007 / QD-BBCVT dated 15/06/2007 of the Minister of Information and Communications. It is the policy of the Party and the State in the division to two telecommunications sector operates independently, creating an active and effective in the field of the environment of international economic integration. Soon after officially went into operation rushed Corporation, consolidate, strengthen the unions. Party Corporation officially established and operated from 19/5/2008. Integration with other countries and regions around the world, the past years, Vietnam Post has not stopped promoting, expanding partnerships with postal members of the Universal Postal Union (UPU) in the areas of: Postal Service, quality management, application of science and technology, commerce and postage stamps, stamp sets general release.","_name":"VietNam Post"},{"key":"22051","_canTrack":"0","_country":"2205","_url":"http://www.vaticanstate.va/","_detail":"The Service of Post and Telegraph manages the activities of collecting, postage and forwarding of correspondence, both inside and outside of the State of Vatican City, and the distribution to the recipients of incoming correspondence; care technical profiles in relations with other postal administrations and bodies, supranational and international authorities. The Vatican Post Office is a service of the Department of Telecommunications of the Governorate of Vatican City. The State of Vatican City, from 1 June 1929, is a member of the Universal Postal Union.","_name":"Vatican Post"},{"key":"23021","_canTrack":"0","_country":"2302","_url":"","_detail":"","_name":"Postal"},{"key":"25011","_canTrack":"1","_country":"2501","_url":"http://www.post.ye/","_detail":"Yemen Post Operates by  the General Authority for Post and Postal Savings under the law of e-No. (64) for the year 1991 and Presidential Decree No. (1) for the year for e-2001, which granted the concession for the management of postal and financial services in all territory of the Republic and enjoy financial and administrative autonomy and managing the activities of its various services on economic grounds and on this basis they are governed also by law governing bodies, public institutions and public companies, and since the establishment  the proclamation of the Republic was organized postal and financial services. By the new state in the development of modern law a new organizational structure of the Authority shall be the work of implementation of the strategic goals of the state contained the law and to meet the needs of the community in all fields and contribute to the work of different development to support the national economy.","_name":"Yemen Post"},{"key":"26011","_canTrack":"1","_country":"2601","_url":"http://www.zampost.com.zm/","_detail":"Zampost exists as a public postal operator established by an Act of Parliament and mandated to provide postal and courier services. Until 1926 when the General Post Office which was then a government department was admitted to the general membership of the Universal Postal Union (UPU). The Postmaster General is the Chief Executive of the Corporation and has a team of five Senior Management Staff heading different directorates in the corporation. These are Director  Operations, Director Human Resources, Director and Finance, Corporation Secretary and Legal Counsel and Chief Internal Auditor. The Government of the Republic of Zambia has 100% equity holding in the Corporation.","_name":"Zambia Post"},{"key":"26021","_canTrack":"1","_country":"2602","_url":"http://www.zimpost.co.zw/","_detail":"Zimbabwe Posts (Pvt) LTD trading as Zimpost, is the leading postal, communication and financial services provider in Zimbabwe. The company has an unrivalled postal network of over 250 postal outlets spread throughout the country. Zimpost was licensed by the Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) in accordance with the provisions of The Postal and Telecommunications Act [Chapter 12:05] of 2000. It is a private limited company wholly owned by the Government of Zimbabwe.","_name":"Zimbabwe Post"},{"key":"89011","_canTrack":"0","_country":"8901","_url":"","_detail":"","_name":"Postal"},{"key":"90011","_canTrack":"0","_country":"9001","_url":"","_detail":"","_name":"Postal"},{"key":"90021","_canTrack":"0","_country":"9002","_url":"http://www.aps.ai/","_detail":"The Anguilla Postal Service has for over half a century provided a vital link of communication for the island's fledgling population locally, regionally and on the international level. From its humble beginning, the Anguilla Postal Service has kept pace with the socio-economic development of the island and has contributed significantly as a revenue generating arm of Government while remaining committed to meeting its social obligation. The Postal Service has evolved from a basic communication medium to a far more commercialized government department, catering to the growing needs of the customer and a steadily expanding population. This contrasting development has been evidenced over the past decade by a number of new services made available to the public including: Express Mail Service (EMS), Private Bag Delivery, Home Shopping, Money Transfer, Money Gram and Internet access.","_name":"Anguilla Post"},{"key":"90031","_canTrack":"0","_country":"9003","_url":"http://www.ascension-island.gov.ac/","_detail":"There is no national postal service within Ascension Island, houses have numbers, but few of the roads have names! All postal addresses here, are those of employing organisations. Organisational representatives collect the mail from the Post Office, but internal deliveries between organisations are to separate boxes, one for each organisation, outside the Administrator's office. As most people within the small communities know each other, mail within Ascension other, than business mail, is very rare! Airmail is received and dispatched twice a week via the RAF Tristar aircraft that flies between the UK and the Falkland Islands. Surface Mail and parcels arrive every month from the UK on the MOD chartered Shipping Service, also en route to the Falklands. Surface Mail to and from Capetown and St Helena, and Surface Mail to the UK travels on the Royal Mail Ship, RMS St Helena as it plies its way through the blue waters of the Atlantic Ocean between Capetown, St Helena, Ascension, and the UK.","_name":"Ascension Island Post"},{"key":"90041","_canTrack":"1","_country":"9004","_url":"http://www.bpo.bm/","_detail":"The Bermuda Post Office is governed by the Post Office Act 1900 and the Post Office Regulations 1933. Over the next few years we will be working to reinvent and right size the BPO. We hope that you will continue to support the BPO and we will use our best efforts to strengthen our relationship with the community we serve. Our miss is \"Together we connect people and businesses by providing efficient, courteous and affordable products and services\".","_name":"Bermuda Post"},{"key":"90051","_canTrack":"0","_country":"9005","_url":"http://www.caymanpost.gov.ky/","_detail":"The Cayman Islands Postal Service (CIPS) has long been an important part of Island life. We provide an essential service to all businesses and households and are part of the global postal network. Our vision is to be our customers' chosen provider of worldwide distribution solutions. We are in a unique position because we have the capacity to reach more residents in the Cayman Islands than any other business. People trust our ability to safely handle their letters and parcels. We employ nearly 100 people. Every working day we collect and process more than 40,000 pieces of mail and deliver them to 11,000 post boxes across all three islands.","_name":"Cayman Islands Post"},{"key":"90061","_canTrack":"1","_country":"9006","_url":"http://www.royalgibraltar.post/","_detail":"The Gibraltar Post Office is a department within the Government of Gibraltar. The last decade has seen improvements in several areas like operations, quality of service, e-commerce and services generally, including a next business day delivery model whereby local mail gets delivered or exported the next working day. The department was awarded the title 'Royal' in April 2005 by Her Majesty the Queen Elizabeth II and is now referred to as the 'Royal Gibraltar Post Office' (RGPO). The RGPO, together with the postal operators of most countries in the world, is a member of the Universal Postal Union (UPU), the organisation whose aim is to maintain a universal postal network between all its cooperating members. It provides guidance and common standards (postal performance and technical) which all members are obliged to meet.","_name":"Gibraltar Post"},{"key":"90071","_canTrack":"0","_country":"9007","_url":"http://www.guernseypost.com/","_detail":"Guernsey Post is a commercial utility wholly owned by the States of Guernsey and regulated by the Channel Islands Competition and Regulatory Authorities (CICRA). It is committed to continual improvement in service delivery and customer relations in its core business, namely the provision of a secure, reliable and efficient postal service. As the sole provider of standard letter post services in the Bailiwick, Guernsey Post operates under a Postal Licence granted by the CICRA. Guernsey Post is required through its Postal Licence (Condition 14.7) to report to CICRA on the quality of its products and services against published regulatory targets. This report is published every six months on this site and released to the Bailiwick's media.","_name":"Guernsey Post"},{"key":"90081","_canTrack":"0","_country":"9008","_url":"http://www.postoffice.gov.sh/","_detail":"The Post Office is a Department of the St Helena Government, under the management of the Postmistress, who is supported by a staff of 10 fulltime members and four part-time employees. Our philatelic service is the largest revenue earning section of the Post Office. We also provide support for the Ascension Island Post Office.","_name":"Saint Helena Post"},{"key":"91011","_canTrack":"0","_country":"9101","_url":"","_detail":"","_name":"Postal"},{"key":"91021","_canTrack":"1","_country":"9102","_url":"http://www.posten.ax/","_detail":"Åland Post is a modern logistics enterprise with some 220 employees at your service. The 2013 turnover was 41.3 million euro. The business headquarters are located in Sviby, Jomala, only a few kilometres outside Mariehamn, the only town in Åland. Since 1 January 2009, Åland Post is a limited company owned solely by the Åland Landskapsregering, the Government of Åland. The line of business in which Åland Post is operating has excellent prospects. The demand for logistics and distribution increases concurrently with the general globalization. E-business is quickly becoming a natural alternative to the traditional retail business. The instruments needed for business on the Internet develop continuously and are becoming more and more cost-effective for every year.","_name":"Aland Post"},{"key":"92011","_canTrack":"0","_country":"9201","_url":"","_detail":"","_name":"Postal"},{"key":"92021","_canTrack":"1","_country":"9202","_url":"http://www.npostna.com/","_detail":"","_name":"Antilles Post"},{"key":"92031","_canTrack":"1","_country":"9203","_url":"http://www.postaruba.com/","_detail":"The Postal Service of Aruba began operating on August 1st 1892, at this time Aruba was part of the \"Colony Curaçao\" Postal Service with its central directorate positioned in Willemstad, Curacao. The Dutch Colonies of which Aruba was part of, is a member of the Universal Postal Union since 1878. On January 1st 1986 the postal service of Aruba entered the Status Aparte within the kingdom of the Netherlands and became an independent postal service, and together with the Netherlands Antilles remained a member of the Universal Postal Union (UPU). On September 1, 2005 Post Aruba N.V. was privatized. Through privatization our main goal was to become an integrated company, not only delivering letters and parcels, but offering a broad variety of new products while playing a key role in all communication needs on the island.","_name":"Aruba Post"},{"key":"93011","_canTrack":"0","_country":"9301","_url":"","_detail":"","_name":"Postal"},{"key":"94011","_canTrack":"0","_country":"9401","_url":"","_detail":"","_name":"Postal"},{"key":"95011","_canTrack":"0","_country":"9501","_url":"","_detail":"","_name":"Postal"},{"key":"95021","_canTrack":"0","_country":"9502","_url":"http://www.norfolkisland.gov.nf/","_detail":"Norfolk Post operates within the Postal Services Act 1983 and is responsible for the receipt and delivery of mail to and from Norfolk. It also sells retail items which are sourced from Australia Post. The Post Office is divided into three areas: Administrative: This area is responsible for the accounting and administrative functions of the branch. Retail: This area is responsible for retail counter sales, restocking, stationary and stamp sales. Mail Processing: This area is responsible for inwards and outwards mail processing.","_name":"Norfolk Post"},{"key":"96011","_canTrack":"0","_country":"9601","_url":"","_detail":"","_name":"Postal"},{"key":"96021","_canTrack":"1","_country":"9602","_url":"http://www.posta.fo/","_detail":"Posta is the postal service of the Faroe Islands and was founded on 1 April 1976 under the Home Rule of the Faroe Islands. On 16 December 2005, it became a public joint stock company under the name P/F Postverk Føroya (retroactive from 1 January 2005). About 290 clerks work for Posta. There are 34 post offices, and 90 postal carriers supporting the country's 17,000 households and 48,000 inhabitants. The Faroese name Postverk Føroya uses the genitive form of the country's name Føroyar (Faroes), thus Føroya without the final r. The name means literally \"Postal works of the Faroes\", while the word for post or mail is postur. In 2010 Postverk Føroya changed name to Posta.","_name":"Faroe Post"},{"key":"96031","_canTrack":"1","_country":"9603","_url":"https://telepost.gl/","_detail":"Behind TELE-POST is the TELE Greenland A/S group, wholly owned by the Government of Greenland.  TELE Greenland A/S covers a population of 56,000 scattered over thousands of kilometres, providing telecommunications, IT and postal services. Even the smallest village has radio, TV and a telephone link to the outside world, and all settlements with a population of more than 70 have broadband Internet and GSM mobile phone service. TELE Greenland A/S employs approximately 460 staff. The head office is in Nuuk, and we have divisions in every town in Greenland.","_name":"Tele Post"},{"key":"97011","_canTrack":"0","_country":"9701","_url":"","_detail":"","_name":"Postal"},{"key":"97021","_canTrack":"1","_country":"9702","_url":"http://www.opt.nc/","_detail":"With over 1000 staff and a wide range of missions, OPT-NC (New Caledonia Postal and Telecommunications Services) is one of the most important public institutions of New Caledonia, and plays a major role in the daily life of all inhabitants of the country. Its nationwide network covers the most isolated areas of the main island and of the Loyalty Islands. OPT-NC steadily continues to fulfil its public service mission and take an active role in town and country planning, by innovating and providing means of communication to as many people as possible. Its commercial network covers the whole Territory and comprises more than 50 branch post offices, 57 mobile postal services routes, 38 mail delivery rounds and 572 sales outlets (OPT and Mobilis retailers).","_name":"OPT-NC"},{"key":"98011","_canTrack":"0","_country":"9801","_url":"","_detail":"","_name":"Postal"},{"key":"99011","_canTrack":"0","_country":"9901","_url":"","_detail":"","_name":"Postal"}]