[{"key":"00","_name":"Not Found","_tips":"Item is not found at this moment, If necessary, please verify with the package sender and check back later.","_00_tipsMore_I1":"The carrier hasn't accepted your package yet.","_00_tipsMore_I2":"The carrier hasn't scanned and entered tracking information for your package yet.","_00_tipsMore_I3":"Your tracking number is incorrect or invalid.","_00_tipsMore_I4":"The item was posted a long time ago, info not available anymore.","_00_tipsMore_IOther":"Generally, after the sender ships your package, it will be processed by the carrier, then they scan and enter the tracking information. There might be a delay between these scanning events and tracking availability in their system. Usually it takes a few days for processing, therefore the tracking information may not appear online immediately, please try to track again later."},{"key":"10","_name":"In Transit","_tips":"Item has shipped from originating country and is en route to its destination.","_10_tipsMore_I1":"Your package has been handed over to the carrier.","_10_tipsMore_I2":"Your package has been dispatched or departed from its country of origin.","_10_tipsMore_I3":"Your package has arrived its destination country and pending customs inspection.","_10_tipsMore_I4":"Your package has arrived its destination country and during domestic transportation.","_10_tipsMore_I5":"Your package is under another transportation period. For instance, it's in another country as a transit point and will be forwarded from there to its final destination country.","_10_tipsMore_IOther":"Please pay attention to detailed tracking information, if your item has arrived its destination country, we'd advise you to track it again within 1-2 days and observe the latest updates to ensure a smooth receipt of the package."},{"key":"20","_name":"Expired","_tips":"Item was in transportation period for a long time still has no delivered results.","_20_tipsMore_I1":"At a certain stage during transportation, the carrier has not updated the tracking information due to the high volume of postage.","_20_tipsMore_I2":"The carrier was omitted the tracking information entry.","_20_tipsMore_I3":"Your package may have been lost during the transportation period.","_20_tipsMore_IOther":"If you ensure your package has been delivered successfully, please ignore this notice. However, if you haven't received your package, please pay attention, we'd advise you to contact the package sender or your shipping carrier for clarification."},{"key":"30","_name":"Pick Up","_tips":"Item is out for delivery or arrived at local facility, you may schedule for delivery or pickup. Please be aware of the collection deadline.","_30_tipsMore_I1":"Your package has arrived at a local delivery point.","_30_tipsMore_I2":"Your package is out for delivery.","_30_tipsMore_IOther":"If you ensure your package has been delivered successfully, please ignore this notice. However, if you haven't received your package, we'd advise you to contact the carrier to arrange a re-delivery or collect your item. Hint: Generally, the carrier has collection deadline, we'd advise you pickup your package at once, or it might be returned to the sender."},{"key":"35","_name":"Undelivered","_tips":"Item was attempted for delivery but failed, this may due to several reasons. Please contact the carrier for clarification.","_35_tipsMore_I1":"Possible reasons for unsuccessful item delivery attempt: addressee not available at the time of delivery; delivery delayed and rescheduled, addressee requested later delivery, address problem - unable to locate premises, rural or remote areas, etc.","_35_tipsMore_IOther":"If you ensure your package has been delivered successfully, please ignore this notice. However, if you haven't received your package, we'd advise you to contact the carrier to arrange a re-delivery or collect your item. Hint: Generally, the carrier has collection deadline, we'd advise you pickup your package at once, or it might be returned to the sender."},{"key":"40","_name":"Delivered","_tips":"Item was delivered successfully to the addressee.","_40_tipsMore_IOther":"Under most circumstances, the delivered status indicates that the carrier has delivered this package successfully. If the addressee didn't receive it, we'd advise you to contact the package sender or shipping carrier for clarification."},{"key":"50","_name":"Alert","_tips":"Item might undergo unusual shipping condition, this may due to several reasons, most likely item was returned to sender, customs issue, lost, damaged etc.","_50_tipsMore_I1":"Your package is being returned to sender due to any of these reasons: item refused by addressee; incorrect / illegible / incomplete address; expired retention period; addressee absence; etc.","_50_tipsMore_I2":"Your package might be retained by customs department due to any of these reasons: contains prohibited goods; importation of the goods is restricted; retained by customs due to tax payable, or any other unspecified reasons.","_50_tipsMore_I3":"Your package may have suffered damage or been lost during the transportation period.","_50_tipsMore_IOther":"If you ensure your package has been delivered successfully, please ignore this notice. However, if you haven't received your package and it is under the\"Alert\" status, then please pay attention: you need to read and analyze the detailed tracking information carefully. Due to complex description of worldwide shipping providers, we can't auto-detect and determine all the status 100% accurately, hope you understand. We'd advise you to contact the package sender or your shipping carrier for clarification."}]